nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name SUB16 - SUB16 Command Register */
/*! @{ */

#define CDOG_SUB16_SB16_MASK                     (0xFFFFFFFFU)
#define CDOG_SUB16_SB16_SHIFT                    (0U)
/*! SB16 - Subtract 16 */
#define CDOG_SUB16_SB16(x)                       (((uint32_t)(((uint32_t)(x)) << CDOG_SUB16_SB16_SHIFT)) & CDOG_SUB16_SB16_MASK)
/*! @} */

/*! @name SUB256 - SUB256 Command Register */
/*! @{ */

#define CDOG_SUB256_SB256_MASK                   (0xFFFFFFFFU)
#define CDOG_SUB256_SB256_SHIFT                  (0U)
/*! SB256 - Subtract 256 */
#define CDOG_SUB256_SB256(x)                     (((uint32_t)(((uint32_t)(x)) << CDOG_SUB256_SB256_SHIFT)) & CDOG_SUB256_SB256_MASK)
/*! @} */

/*! @name ASSERT16 - ASSERT16 Command Register */
/*! @{ */

#define CDOG_ASSERT16_AST16_MASK                 (0xFFFFFFFFU)
#define CDOG_ASSERT16_AST16_SHIFT                (0U)
/*! AST16 - ASSERT16 Command */
#define CDOG_ASSERT16_AST16(x)                   (((uint32_t)(((uint32_t)(x)) << CDOG_ASSERT16_AST16_SHIFT)) & CDOG_ASSERT16_AST16_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CDOG_Register_Masks */


/* CDOG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CDOG3 base address */
  #define CDOG3_BASE                               (0x5032B000u)
  /** Peripheral CDOG3 base address */
  #define CDOG3_BASE_NS                            (0x4032B000u)
  /** Peripheral CDOG3 base pointer */
  #define CDOG3                                    ((CDOG_Type *)CDOG3_BASE)
  /** Peripheral CDOG3 base pointer */
  #define CDOG3_NS                                 ((CDOG_Type *)CDOG3_BASE_NS)
  /** Peripheral CDOG4 base address */
  #define CDOG4_BASE                               (0x5032A000u)
  /** Peripheral CDOG4 base address */
  #define CDOG4_BASE_NS                            (0x4032A000u)
  /** Peripheral CDOG4 base pointer */
  #define CDOG4                                    ((CDOG_Type *)CDOG4_BASE)
  /** Peripheral CDOG4 base pointer */
  #define CDOG4_NS                                 ((CDOG_Type *)CDOG4_BASE_NS)
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS                          { 0u, 0u, 0u, CDOG3_BASE, CDOG4_BASE }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS                           { (CDOG_Type *)0u, (CDOG_Type *)0u, (CDOG_Type *)0u, CDOG3, CDOG4 }
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS_NS                       { 0u, 0u, 0u, CDOG3_BASE_NS, CDOG4_BASE_NS }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS_NS                        { (CDOG_Type *)0u, (CDOG_Type *)0u, (CDOG_Type *)0u, CDOG3_NS, CDOG4_NS }
#else
  /** Peripheral CDOG3 base address */
  #define CDOG3_BASE                               (0x4032B000u)
  /** Peripheral CDOG3 base pointer */
  #define CDOG3                                    ((CDOG_Type *)CDOG3_BASE)
  /** Peripheral CDOG4 base address */
  #define CDOG4_BASE                               (0x4032A000u)
  /** Peripheral CDOG4 base pointer */
  #define CDOG4                                    ((CDOG_Type *)CDOG4_BASE)
  /** Array initializer of CDOG peripheral base addresses */
  #define CDOG_BASE_ADDRS                          { 0u, 0u, 0u, CDOG3_BASE, CDOG4_BASE }
  /** Array initializer of CDOG peripheral base pointers */
  #define CDOG_BASE_PTRS                           { (CDOG_Type *)0u, (CDOG_Type *)0u, (CDOG_Type *)0u, CDOG3, CDOG4 }
#endif
/** Interrupt vectors for the CDOG peripheral type */
#define CDOG_IRQS                                { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, CDOG3_IRQn, CDOG4_IRQn }

/*!
 * @}
 */ /* end of group CDOG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CLKCTL1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL1_Peripheral_Access_Layer CLKCTL1 Peripheral Access Layer
 * @{
 */

/** CLKCTL1 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0;                           /**< VDD1_SENSE Peripheral Clock Control 0, offset: 0x10 */
  __IO uint32_t PSCCTL1;                           /**< VDD1_SENSE Peripheral Clock Control 1, offset: 0x14 */
       uint8_t RESERVED_1[40];
  __IO uint32_t PSCCTL0_SET;                       /**< VDD1_SENSE Peripheral Clock Control 0 Set, offset: 0x40 */
  __IO uint32_t PSCCTL1_SET;                       /**< VDD1_SENSE Peripheral Clock Control 1 Set, offset: 0x44 */
       uint8_t RESERVED_2[40];
  __IO uint32_t PSCCTL0_CLR;                       /**< VDD1_SENSE Peripheral Clock Control 0 Clear, offset: 0x70 */
  __IO uint32_t PSCCTL1_CLR;                       /**< VDD1_SENSE Peripheral Clock Control 1 Clear, offset: 0x74 */
       uint8_t RESERVED_3[960];
  __IO uint32_t SENSEBASECLKSEL;                   /**< VDD1_SENSE Base Clock Select Source, offset: 0x438 */
       uint8_t RESERVED_4[4];
  __IO uint32_t SENSEDSPCPUCLKDIV;                 /**< CPU Clock of DSP in VDD1_SENSE Clock Divider, offset: 0x440 */
  __IO uint32_t SENSEDSPCPUCLKSEL;                 /**< CPU Clock of DSP in VDD1_SENSE Clock Select, offset: 0x444 */
       uint8_t RESERVED_5[184];
  __IO uint32_t SAI3FCLKSEL;                       /**< SAI3 Clock Select Source, offset: 0x500 */
  __IO uint32_t SAI3CLKDIV;                        /**< SAI3 Functional Clock Divider, offset: 0x504 */
       uint8_t RESERVED_6[504];
  __IO uint32_t UTICK1FCLKSEL;                     /**< UTICK1 Functional Clock Source Select, offset: 0x700 */
  __IO uint32_t UTICK1CLKDIV;                      /**< UTICK1 Functional Clock Divider, offset: 0x704 */
       uint8_t RESERVED_7[24];
  __IO uint32_t WWDT2FCLKSEL;                      /**< WWDT2 Functional Clock Source Select, offset: 0x720 */
       uint8_t RESERVED_8[28];
  __IO uint32_t WWDT3FCLKSEL;                      /**< WWDT3 Functional Clock Source Select, offset: 0x740 */
       uint8_t RESERVED_9[28];
  __IO uint32_t SYSTICKFCLKSEL;                    /**< SYSTICK Functional Clock Select Source, offset: 0x760 */
  __IO uint32_t SYSTICKFCLKDIV;                    /**< SYSTICK Functional Clock Divider, offset: 0x764 */
       uint8_t RESERVED_10[56];
  __IO uint32_t CTIMERFCLKSEL[3];                  /**< CTIMER5 Functional Clock Source Select..CTIMER7 Functional Clock Source Select, array offset: 0x7A0, array step: 0x4 */
       uint8_t RESERVED_11[4];
  __IO uint32_t CTIMERCLKDIV[3];                   /**< CTIMER5 Functional Clock Divider..CTIMER7 Functional Clock Divider, array offset: 0x7B0, array step: 0x4 */
       uint8_t RESERVED_12[68];
  __IO uint32_t I3C23FCLKSEL;                      /**< I3C2 and I3C3 Functional Clock Source Select, offset: 0x800 */
       uint8_t RESERVED_13[12];
  __IO uint32_t I3C23FCLKDIV;                      /**< I3C2 and I3C3 Functional Clock Divider, offset: 0x810 */
       uint8_t RESERVED_14[492];
  struct {                                         /* offset: 0xA00, array step: 0x20 */
    __IO uint32_t FCFCLKSEL;                         /**< LP_FLEXCOMM17 Clock Source Select..LP_FLEXCOMM20 Clock Source Select, array offset: 0xA00, array step: 0x20 */
    __IO uint32_t FCFCLKDIV;                         /**< LP_FLEXCOMM17 Clock Divider..LP_FLEXCOMM20 Clock Divider, array offset: 0xA04, array step: 0x20 */
         uint8_t RESERVED_0[24];
  } FLEXCOMM[4];
       uint8_t RESERVED_15[32];
  __IO uint32_t AUDIOVDD1CLKSEL;                   /**< VDD1_SENSE Audio Clock Source, offset: 0xAA0 */
} CLKCTL1_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL1_Register_Masks CLKCTL1 Register Masks
 * @{
 */

/*! @name PSCCTL0 - VDD1_SENSE Peripheral Clock Control 0 */
/*! @{ */

#define CLKCTL1_PSCCTL0_SLEEPCON1_MASK           (0x40U)
#define CLKCTL1_PSCCTL0_SLEEPCON1_SHIFT          (6U)
/*! SLEEPCON1 - SLEEPCON1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL0_SLEEPCON1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SLEEPCON1_SHIFT)) & CLKCTL1_PSCCTL0_SLEEPCON1_MASK)

#define CLKCTL1_PSCCTL0_SYSCON1_MASK             (0x80U)
#define CLKCTL1_PSCCTL0_SYSCON1_SHIFT            (7U)
/*! SYSCON1 - SYSCON1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL0_SYSCON1(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SYSCON1_SHIFT)) & CLKCTL1_PSCCTL0_SYSCON1_MASK)
/*! @} */

