nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define CLKCTL1_PSCCTL1_CDOG4_MASK               (0x800000U)
#define CLKCTL1_PSCCTL1_CDOG4_SHIFT              (23U)
/*! CDOG4 - CDOG4 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_CDOG4(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CDOG4_SHIFT)) & CLKCTL1_PSCCTL1_CDOG4_MASK)

#define CLKCTL1_PSCCTL1_MU3_MASK                 (0x1000000U)
#define CLKCTL1_PSCCTL1_MU3_SHIFT                (24U)
/*! MU3 - MU3 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_MU3(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_MU3_SHIFT)) & CLKCTL1_PSCCTL1_MU3_MASK)

#define CLKCTL1_PSCCTL1_SEMA42_3_MASK            (0x2000000U)
#define CLKCTL1_PSCCTL1_SEMA42_3_SHIFT           (25U)
/*! SEMA42_3 - SEMA42_3 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_SEMA42_3(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SEMA42_3_SHIFT)) & CLKCTL1_PSCCTL1_SEMA42_3_MASK)

#define CLKCTL1_PSCCTL1_WWDT2_MASK               (0x4000000U)
#define CLKCTL1_PSCCTL1_WWDT2_SHIFT              (26U)
/*! WWDT2 - WWDT2 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_WWDT2(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_WWDT2_SHIFT)) & CLKCTL1_PSCCTL1_WWDT2_MASK)

#define CLKCTL1_PSCCTL1_WWDT3_MASK               (0x8000000U)
#define CLKCTL1_PSCCTL1_WWDT3_SHIFT              (27U)
/*! WWDT3 - WWDT3 clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_WWDT3(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_WWDT3_SHIFT)) & CLKCTL1_PSCCTL1_WWDT3_MASK)

#define CLKCTL1_PSCCTL1_INPUTMUX1_MASK           (0x40000000U)
#define CLKCTL1_PSCCTL1_INPUTMUX1_SHIFT          (30U)
/*! INPUTMUX1 - INPUTMUX1 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL1_PSCCTL1_INPUTMUX1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_INPUTMUX1_SHIFT)) & CLKCTL1_PSCCTL1_INPUTMUX1_MASK)
/*! @} */

/*! @name PSCCTL0_SET - VDD1_SENSE Peripheral Clock Control 0 Set */
/*! @{ */

#define CLKCTL1_PSCCTL0_SET_SLEEPCON1_MASK       (0x40U)
#define CLKCTL1_PSCCTL0_SET_SLEEPCON1_SHIFT      (6U)
/*! SLEEPCON1 - SLEEPCON1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL0_SET_SLEEPCON1(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_SLEEPCON1_SHIFT)) & CLKCTL1_PSCCTL0_SET_SLEEPCON1_MASK)

#define CLKCTL1_PSCCTL0_SET_SYSCON1_MASK         (0x80U)
#define CLKCTL1_PSCCTL0_SET_SYSCON1_SHIFT        (7U)
/*! SYSCON1 - SYSCON1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL0_SET_SYSCON1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_SYSCON1_SHIFT)) & CLKCTL1_PSCCTL0_SET_SYSCON1_MASK)
/*! @} */

/*! @name PSCCTL1_SET - VDD1_SENSE Peripheral Clock Control 1 Set */
/*! @{ */

#define CLKCTL1_PSCCTL1_SET_SENSE_ACCESS_RAM_ARBITER0_MASK (0x1U)
#define CLKCTL1_PSCCTL1_SET_SENSE_ACCESS_RAM_ARBITER0_SHIFT (0U)
/*! SENSE_ACCESS_RAM_ARBITER0 - VDD1_SENSE Access RAM Arbiter0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL1_PSCCTL1_SET_SENSE_ACCESS_RAM_ARBITER0(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_SENSE_ACCESS_RAM_ARBITER0_SHIFT)) & CLKCTL1_PSCCTL1_SET_SENSE_ACCESS_RAM_ARBITER0_MASK)

#define CLKCTL1_PSCCTL1_SET_HIFI1_MASK           (0x2U)
#define CLKCTL1_PSCCTL1_SET_HIFI1_SHIFT          (1U)
/*! HiFi1 - HiFi1 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_HIFI1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HIFI1_SHIFT)) & CLKCTL1_PSCCTL1_SET_HIFI1_MASK)

#define CLKCTL1_PSCCTL1_SET_EDMA2_MASK           (0x10U)
#define CLKCTL1_PSCCTL1_SET_EDMA2_SHIFT          (4U)
/*! eDMA2 - eDMA2 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_EDMA2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_EDMA2_SHIFT)) & CLKCTL1_PSCCTL1_SET_EDMA2_MASK)

#define CLKCTL1_PSCCTL1_SET_EDMA3_MASK           (0x20U)
#define CLKCTL1_PSCCTL1_SET_EDMA3_SHIFT          (5U)
/*! eDMA3 - eDMA3 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_EDMA3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_EDMA3_SHIFT)) & CLKCTL1_PSCCTL1_SET_EDMA3_MASK)

#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM17_MASK   (0x40U)
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM17_SHIFT  (6U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM17(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM17_SHIFT)) & CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM17_MASK)

#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM18_MASK   (0x80U)
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM18_SHIFT  (7U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM18(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM18_SHIFT)) & CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM18_MASK)

#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM19_MASK   (0x100U)
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM19_SHIFT  (8U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM19(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM19_SHIFT)) & CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM19_MASK)

#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM20_MASK   (0x200U)
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM20_SHIFT  (9U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM20(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM20_SHIFT)) & CLKCTL1_PSCCTL1_SET_LP_FLEXCOMM20_MASK)

#define CLKCTL1_PSCCTL1_SET_SAI3_MASK            (0x400U)
#define CLKCTL1_PSCCTL1_SET_SAI3_SHIFT           (10U)
/*! SAI3 - SAI3 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_SAI3(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_SAI3_SHIFT)) & CLKCTL1_PSCCTL1_SET_SAI3_MASK)

#define CLKCTL1_PSCCTL1_SET_I3C2_MASK            (0x800U)
#define CLKCTL1_PSCCTL1_SET_I3C2_SHIFT           (11U)
/*! I3C2 - I3C2 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_SET_I3C2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_I3C2_SHIFT)) & CLKCTL1_PSCCTL1_SET_I3C2_MASK)

