nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define CLKCTL1_PSCCTL1_CLR_CDOG4_MASK           (0x800000U)
#define CLKCTL1_PSCCTL1_CLR_CDOG4_SHIFT          (23U)
/*! CDOG4 - CDOG4 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_CDOG4(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_CDOG4_SHIFT)) & CLKCTL1_PSCCTL1_CLR_CDOG4_MASK)

#define CLKCTL1_PSCCTL1_CLR_MU3_MASK             (0x1000000U)
#define CLKCTL1_PSCCTL1_CLR_MU3_SHIFT            (24U)
/*! MU3 - MU3 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_MU3(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_MU3_SHIFT)) & CLKCTL1_PSCCTL1_CLR_MU3_MASK)

#define CLKCTL1_PSCCTL1_CLR_SEMA42_3_MASK        (0x2000000U)
#define CLKCTL1_PSCCTL1_CLR_SEMA42_3_SHIFT       (25U)
/*! SEMA42_3 - SEMA42_3 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_SEMA42_3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_SEMA42_3_SHIFT)) & CLKCTL1_PSCCTL1_CLR_SEMA42_3_MASK)

#define CLKCTL1_PSCCTL1_CLR_WWDT2_MASK           (0x4000000U)
#define CLKCTL1_PSCCTL1_CLR_WWDT2_SHIFT          (26U)
/*! WWDT2 - WWDT2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_WWDT2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_WWDT2_SHIFT)) & CLKCTL1_PSCCTL1_CLR_WWDT2_MASK)

#define CLKCTL1_PSCCTL1_CLR_WWDT3_MASK           (0x8000000U)
#define CLKCTL1_PSCCTL1_CLR_WWDT3_SHIFT          (27U)
/*! WWDT3 - WWDT3 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_WWDT3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_WWDT3_SHIFT)) & CLKCTL1_PSCCTL1_CLR_WWDT3_MASK)

#define CLKCTL1_PSCCTL1_CLR_INPUTMUX1_MASK       (0x40000000U)
#define CLKCTL1_PSCCTL1_CLR_INPUTMUX1_SHIFT      (30U)
/*! INPUTMUX1 - INPUTMUX1 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL1_PSCCTL1_CLR_INPUTMUX1(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_INPUTMUX1_SHIFT)) & CLKCTL1_PSCCTL1_CLR_INPUTMUX1_MASK)
/*! @} */

/*! @name SENSEBASECLKSEL - VDD1_SENSE Base Clock Select Source */
/*! @{ */

#define CLKCTL1_SENSEBASECLKSEL_SEL_MASK         (0x3U)
#define CLKCTL1_SENSEBASECLKSEL_SEL_SHIFT        (0U)
/*! SEL - Clock Source Select for Main VDD1_SENSE Base Clock
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro2_div3
 *  0b11..1m_lposc
 */
#define CLKCTL1_SENSEBASECLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEBASECLKSEL_SEL_SHIFT)) & CLKCTL1_SENSEBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name SENSEDSPCPUCLKDIV - CPU Clock of DSP in VDD1_SENSE Clock Divider */
/*! @{ */

#define CLKCTL1_SENSEDSPCPUCLKDIV_DIV_MASK       (0xFFU)
#define CLKCTL1_SENSEDSPCPUCLKDIV_DIV_SHIFT      (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL1_SENSEDSPCPUCLKDIV_DIV(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEDSPCPUCLKDIV_DIV_SHIFT)) & CLKCTL1_SENSEDSPCPUCLKDIV_DIV_MASK)

#define CLKCTL1_SENSEDSPCPUCLKDIV_BUSY_MASK      (0x10000000U)
#define CLKCTL1_SENSEDSPCPUCLKDIV_BUSY_SHIFT     (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SENSEDSPCPUCLKDIV_BUSY(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEDSPCPUCLKDIV_BUSY_SHIFT)) & CLKCTL1_SENSEDSPCPUCLKDIV_BUSY_MASK)

#define CLKCTL1_SENSEDSPCPUCLKDIV_REQFLAG_MASK   (0x80000000U)
#define CLKCTL1_SENSEDSPCPUCLKDIV_REQFLAG_SHIFT  (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SENSEDSPCPUCLKDIV_REQFLAG(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEDSPCPUCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_SENSEDSPCPUCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SENSEDSPCPUCLKSEL - CPU Clock of DSP in VDD1_SENSE Clock Select */
/*! @{ */

#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL_MASK       (0x3U)
#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL_SHIFT      (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_max
 *  0b10..audio_pll_pfd1
 *  0b11..fro1_max
 */
#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEDSPCPUCLKSEL_SEL_SHIFT)) & CLKCTL1_SENSEDSPCPUCLKSEL_SEL_MASK)

#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN_MASK    (0x4U)
#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN_SHIFT   (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_SENSEDSPCPUCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SAI3FCLKSEL - SAI3 Clock Select Source */
/*! @{ */

#define CLKCTL1_SAI3FCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL1_SAI3FCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_div8
 *  0b10..fro2_max
 *  0b11..audio_clk
 */
#define CLKCTL1_SAI3FCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3FCLKSEL_SEL_SHIFT)) & CLKCTL1_SAI3FCLKSEL_SEL_MASK)

#define CLKCTL1_SAI3FCLKSEL_SEL_EN_MASK          (0x4U)
#define CLKCTL1_SAI3FCLKSEL_SEL_EN_SHIFT         (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_SAI3FCLKSEL_SEL_EN(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3FCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_SAI3FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SAI3CLKDIV - SAI3 Functional Clock Divider */
/*! @{ */

#define CLKCTL1_SAI3CLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL1_SAI3CLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL1_SAI3CLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3CLKDIV_DIV_SHIFT)) & CLKCTL1_SAI3CLKDIV_DIV_MASK)

#define CLKCTL1_SAI3CLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL1_SAI3CLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SAI3CLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3CLKDIV_BUSY_SHIFT)) & CLKCTL1_SAI3CLKDIV_BUSY_MASK)

#define CLKCTL1_SAI3CLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL1_SAI3CLKDIV_RESET_SHIFT           (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_SAI3CLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3CLKDIV_RESET_SHIFT)) & CLKCTL1_SAI3CLKDIV_RESET_MASK)

#define CLKCTL1_SAI3CLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL1_SAI3CLKDIV_HALT_SHIFT            (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_SAI3CLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3CLKDIV_HALT_SHIFT)) & CLKCTL1_SAI3CLKDIV_HALT_MASK)

#define CLKCTL1_SAI3CLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL1_SAI3CLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SAI3CLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SAI3CLKDIV_REQFLAG_SHIFT)) & CLKCTL1_SAI3CLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name UTICK1FCLKSEL - UTICK1 Functional Clock Source Select */
/*! @{ */

#define CLKCTL1_UTICK1FCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL1_UTICK1FCLKSEL_SEL_SHIFT          (0U)
/*! SEL - UTICK Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..1m_lposc
 *  0b10..fro2_max
 *  0b11..fro1_div2
 */
#define CLKCTL1_UTICK1FCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1FCLKSEL_SEL_SHIFT)) & CLKCTL1_UTICK1FCLKSEL_SEL_MASK)

#define CLKCTL1_UTICK1FCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL1_UTICK1FCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_UTICK1FCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1FCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_UTICK1FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name UTICK1CLKDIV - UTICK1 Functional Clock Divider */
/*! @{ */

