nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/* The count of CLKCTL1_FCFCLKSEL */
#define CLKCTL1_FCFCLKSEL_COUNT                  (4U)

/*! @name FCFCLKDIV - LP_FLEXCOMM17 Clock Divider..LP_FLEXCOMM20 Clock Divider */
/*! @{ */

#define CLKCTL1_FCFCLKDIV_DIV_MASK               (0xFFU)
#define CLKCTL1_FCFCLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL1_FCFCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_DIV_SHIFT)) & CLKCTL1_FCFCLKDIV_DIV_MASK)

#define CLKCTL1_FCFCLKDIV_BUSY_MASK              (0x10000000U)
#define CLKCTL1_FCFCLKDIV_BUSY_SHIFT             (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_FCFCLKDIV_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_BUSY_SHIFT)) & CLKCTL1_FCFCLKDIV_BUSY_MASK)

#define CLKCTL1_FCFCLKDIV_RESET_MASK             (0x20000000U)
#define CLKCTL1_FCFCLKDIV_RESET_SHIFT            (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_FCFCLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_RESET_SHIFT)) & CLKCTL1_FCFCLKDIV_RESET_MASK)

#define CLKCTL1_FCFCLKDIV_HALT_MASK              (0x40000000U)
#define CLKCTL1_FCFCLKDIV_HALT_SHIFT             (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_FCFCLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_HALT_SHIFT)) & CLKCTL1_FCFCLKDIV_HALT_MASK)

#define CLKCTL1_FCFCLKDIV_REQFLAG_MASK           (0x80000000U)
#define CLKCTL1_FCFCLKDIV_REQFLAG_SHIFT          (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished
 *  0b1..A change is being made to the divider value
 */
#define CLKCTL1_FCFCLKDIV_REQFLAG(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_FCFCLKDIV_REQFLAG_MASK)
/*! @} */

/* The count of CLKCTL1_FCFCLKDIV */
#define CLKCTL1_FCFCLKDIV_COUNT                  (4U)

/*! @name AUDIOVDD1CLKSEL - VDD1_SENSE Audio Clock Source */
/*! @{ */

#define CLKCTL1_AUDIOVDD1CLKSEL_SEL_MASK         (0x3U)
#define CLKCTL1_AUDIOVDD1CLKSEL_SEL_SHIFT        (0U)
/*! SEL - Clock Source Select
 *  0b00..mclk_in
 *  0b01..osc_clk
 *  0b10..fro2_div8
 *  0b11..audio_pll_pfd3
 */
#define CLKCTL1_AUDIOVDD1CLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOVDD1CLKSEL_SEL_SHIFT)) & CLKCTL1_AUDIOVDD1CLKSEL_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CLKCTL1_Register_Masks */


/* CLKCTL1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CLKCTL1 base address */
  #define CLKCTL1_BASE                             (0x50041000u)
  /** Peripheral CLKCTL1 base address */
  #define CLKCTL1_BASE_NS                          (0x40041000u)
  /** Peripheral CLKCTL1 base pointer */
  #define CLKCTL1                                  ((CLKCTL1_Type *)CLKCTL1_BASE)
  /** Peripheral CLKCTL1 base pointer */
  #define CLKCTL1_NS                               ((CLKCTL1_Type *)CLKCTL1_BASE_NS)
  /** Array initializer of CLKCTL1 peripheral base addresses */
  #define CLKCTL1_BASE_ADDRS                       { CLKCTL1_BASE }
  /** Array initializer of CLKCTL1 peripheral base pointers */
  #define CLKCTL1_BASE_PTRS                        { CLKCTL1 }
  /** Array initializer of CLKCTL1 peripheral base addresses */
  #define CLKCTL1_BASE_ADDRS_NS                    { CLKCTL1_BASE_NS }
  /** Array initializer of CLKCTL1 peripheral base pointers */
  #define CLKCTL1_BASE_PTRS_NS                     { CLKCTL1_NS }
#else
  /** Peripheral CLKCTL1 base address */
  #define CLKCTL1_BASE                             (0x40041000u)
  /** Peripheral CLKCTL1 base pointer */
  #define CLKCTL1                                  ((CLKCTL1_Type *)CLKCTL1_BASE)
  /** Array initializer of CLKCTL1 peripheral base addresses */
  #define CLKCTL1_BASE_ADDRS                       { CLKCTL1_BASE }
  /** Array initializer of CLKCTL1 peripheral base pointers */
  #define CLKCTL1_BASE_PTRS                        { CLKCTL1 }
#endif

/*!
 * @}
 */ /* end of group CLKCTL1_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CLKCTL2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL2_Peripheral_Access_Layer CLKCTL2 Peripheral Access Layer
 * @{
 */

/** CLKCTL2 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0;                           /**< VDDN_COM Peripheral clock 0, offset: 0x10 */
       uint8_t RESERVED_1[44];
  __IO uint32_t PSCCTL0_SET;                       /**< VDDN_COM Peripheral Clock 0 Set, offset: 0x40 */
       uint8_t RESERVED_2[44];
  __IO uint32_t PSCCTL0_CLR;                       /**< VDDN_COM Peripheral Clock 0 Clear, offset: 0x70 */
       uint8_t RESERVED_3[48];
  __IO uint32_t COMMONVDDNCLKSEL;                  /**< VDDN_COM Clock Source Select, offset: 0xA4 */
       uint8_t RESERVED_4[4];
  __IO uint32_t COMMONVDDNCLKDIV;                  /**< VDDN_COM Clock Divider, offset: 0xAC */
       uint8_t RESERVED_5[80];
  __IO uint32_t SYSOSCCTL0;                        /**< XTAL Oscillator Control 0, offset: 0x100 */
       uint8_t RESERVED_6[4];
  __IO uint32_t SYSOSCBYPASS;                      /**< OSC Bypass Clock Source Select, offset: 0x108 */
  __IO uint32_t USBCLKSRC24MCLKSEL;                /**< USB0 Clock Source Select, offset: 0x10C */
  __IO uint32_t COMNBASECLKSEL;                    /**< VDDN_COM Base Clock Source Select, offset: 0x110 */
       uint8_t RESERVED_7[8];
  __IO uint32_t EUSBCLKSRC24MCLKSEL;               /**< USB1 (eUSB) Clock Source Select, offset: 0x11C */
       uint8_t RESERVED_8[224];
  __IO uint32_t MAINPLL0CLKSEL;                    /**< Main PLL0 Clock Source Select, offset: 0x200 */
  __IO uint32_t MAINPLL0CTL0;                      /**< Main PLL0 Control 0, offset: 0x204 */
       uint8_t RESERVED_9[4];
  __IO uint32_t MAINPLL0LOCKTIMEDIV2;              /**< Main PLL0 Lock Time Div2, offset: 0x20C */
  __IO uint32_t MAINPLL0NUM;                       /**< Main PLL0 Numerator, offset: 0x210 */
  __IO uint32_t MAINPLL0DENOM;                     /**< Main PLL0 Denominator, offset: 0x214 */
  __IO uint32_t MAINPLL0PFD;                       /**< Main PLL0 PFD, offset: 0x218 */
       uint8_t RESERVED_10[4];
  __IO uint32_t MAINPLL0PFDDOMAINEN;               /**< Main PLL0 PFD Clock Domain Enable, offset: 0x220 */
       uint8_t RESERVED_11[476];
  __IO uint32_t AUDIOPLL0CLKSEL;                   /**< Audio PLL0 Clock Source Select, offset: 0x400 */
  __IO uint32_t AUDIOPLL0CTL0;                     /**< Audio PLL0 Control 0, offset: 0x404 */
       uint8_t RESERVED_12[4];
  __IO uint32_t AUDIOPLL0LOCKTIMEDIV2;             /**< Audio PLL0 Lock Time Divide-by-2, offset: 0x40C */
  __IO uint32_t AUDIOPLL0NUM;                      /**< Audio PLL0 Numerator, offset: 0x410 */
  __IO uint32_t AUDIOPLL0DENOM;                    /**< Audio PLL0 Denominator, offset: 0x414 */
  __IO uint32_t AUDIOPLL0PFD;                      /**< Audio PLL0 PFD, offset: 0x418 */
       uint8_t RESERVED_13[4];
  __IO uint32_t AUDIOPLL0PFDDOMAINEN;              /**< Audio PLL0 PFD Clock Enable, offset: 0x420 */
  __IO uint32_t AUDIOPLL0VCODOMAINEN;              /**< Audio PLL0 VCO Clock Enable, offset: 0x424 */
       uint8_t RESERVED_14[472];
  __IO uint32_t CKIL_32K_GATE;                     /**< CKIL 32kHz Clock Gate, offset: 0x600 */
} CLKCTL2_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL2_Register_Masks CLKCTL2 Register Masks
 * @{
 */

/*! @name PSCCTL0 - VDDN_COM Peripheral clock 0 */
/*! @{ */

#define CLKCTL2_PSCCTL0_SYSCON2_MASK             (0x8U)
#define CLKCTL2_PSCCTL0_SYSCON2_SHIFT            (3U)
/*! SYSCON2 - SYSCON2 clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL2_PSCCTL0_SYSCON2(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_SYSCON2_SHIFT)) & CLKCTL2_PSCCTL0_SYSCON2_MASK)

#define CLKCTL2_PSCCTL0_IOPCTL2_MASK             (0x10U)
#define CLKCTL2_PSCCTL0_IOPCTL2_SHIFT            (4U)
/*! IOPCTL2 - IOPCTL2 clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL2_PSCCTL0_IOPCTL2(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_IOPCTL2_SHIFT)) & CLKCTL2_PSCCTL0_IOPCTL2_MASK)
/*! @} */

/*! @name PSCCTL0_SET - VDDN_COM Peripheral Clock 0 Set */
/*! @{ */

#define CLKCTL2_PSCCTL0_SET_SYSCON2_MASK         (0x8U)
#define CLKCTL2_PSCCTL0_SET_SYSCON2_SHIFT        (3U)
/*! SYSCON2 - SYSCON2 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL2_PSCCTL0_SET_SYSCON2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_SET_SYSCON2_SHIFT)) & CLKCTL2_PSCCTL0_SET_SYSCON2_MASK)

#define CLKCTL2_PSCCTL0_SET_IOPCTL2_MASK         (0x10U)
#define CLKCTL2_PSCCTL0_SET_IOPCTL2_SHIFT        (4U)
/*! IOPCTL2 - IOPCTL2 Clock
 *  0b1..Enable
 *  0b0..No effect
 */
#define CLKCTL2_PSCCTL0_SET_IOPCTL2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_SET_IOPCTL2_SHIFT)) & CLKCTL2_PSCCTL0_SET_IOPCTL2_MASK)
/*! @} */

/*! @name PSCCTL0_CLR - VDDN_COM Peripheral Clock 0 Clear */
/*! @{ */

#define CLKCTL2_PSCCTL0_CLR_SYSCON2_MASK         (0x8U)
#define CLKCTL2_PSCCTL0_CLR_SYSCON2_SHIFT        (3U)
/*! SYSCON2 - SYSCON2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL2_PSCCTL0_CLR_SYSCON2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_CLR_SYSCON2_SHIFT)) & CLKCTL2_PSCCTL0_CLR_SYSCON2_MASK)

#define CLKCTL2_PSCCTL0_CLR_IOPCTL2_MASK         (0x10U)
#define CLKCTL2_PSCCTL0_CLR_IOPCTL2_SHIFT        (4U)
/*! IOPCTL2 - IOPCTL2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL2_PSCCTL0_CLR_IOPCTL2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_PSCCTL0_CLR_IOPCTL2_SHIFT)) & CLKCTL2_PSCCTL0_CLR_IOPCTL2_MASK)
/*! @} */

