nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name PSCCTL1_MEDIA_CLR - VDD2_COMP Media Peripheral Clock Control 1 Clear */
/*! @{ */

#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB0_MASK      (0x1U)
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB0_SHIFT     (0U)
/*! USB0 - USB0 and USBPHY0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB0(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_MEDIA_CLR_USB0_SHIFT)) & CLKCTL4_PSCCTL1_MEDIA_CLR_USB0_MASK)

#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB1_MASK      (0x4U)
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB1_SHIFT     (2U)
/*! USB1 - USB1 and eUSBPHY Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USB1(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_MEDIA_CLR_USB1_SHIFT)) & CLKCTL4_PSCCTL1_MEDIA_CLR_USB1_MASK)

#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC0_MASK    (0x10U)
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC0_SHIFT   (4U)
/*! uSDHC0 - uSDHC0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC0_SHIFT)) & CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC0_MASK)

#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC1_MASK    (0x20U)
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC1_SHIFT   (5U)
/*! uSDHC1 - uSDHC1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC1_SHIFT)) & CLKCTL4_PSCCTL1_MEDIA_CLR_USDHC1_MASK)
/*! @} */

/*! @name ONE_SRC_CLKSLICE_ENABLE - One Source Clock Slice Enable for VDD2_COMP Core */
/*! @{ */

#define CLKCTL4_ONE_SRC_CLKSLICE_ENABLE_USBPHY_REFCLK_EN_MASK (0x1U)
#define CLKCTL4_ONE_SRC_CLKSLICE_ENABLE_USBPHY_REFCLK_EN_SHIFT (0U)
/*! USBPHY_REFCLK_EN - USBPHY0 Reference Clock
 *  0b0..Gates USBPHY0 reference clock.
 *  0b1..Enables USBPHY0 reference clock.
 */
#define CLKCTL4_ONE_SRC_CLKSLICE_ENABLE_USBPHY_REFCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL4_ONE_SRC_CLKSLICE_ENABLE_USBPHY_REFCLK_EN_SHIFT)) & CLKCTL4_ONE_SRC_CLKSLICE_ENABLE_USBPHY_REFCLK_EN_MASK)
/*! @} */

/*! @name MEDIAVDDNCLKSEL - VDDN_MEDIA Clock Source Select */
/*! @{ */

#define CLKCTL4_MEDIAVDDNCLKSEL_SEL_MASK         (0x3U)
#define CLKCTL4_MEDIAVDDNCLKSEL_SEL_SHIFT        (0U)
/*! SEL - VDDN Clock Source Select
 *  0b00..baseclk_mdn
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd2
 */
#define CLKCTL4_MEDIAVDDNCLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAVDDNCLKSEL_SEL_SHIFT)) & CLKCTL4_MEDIAVDDNCLKSEL_SEL_MASK)
/*! @} */

/*! @name MEDIAVDDNCLKDIV - VDDN_MEDIA Clock Divider */
/*! @{ */

#define CLKCTL4_MEDIAVDDNCLKDIV_DIV_MASK         (0xFFU)
#define CLKCTL4_MEDIAVDDNCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_MEDIAVDDNCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAVDDNCLKDIV_DIV_SHIFT)) & CLKCTL4_MEDIAVDDNCLKDIV_DIV_MASK)

#define CLKCTL4_MEDIAVDDNCLKDIV_BUSY_MASK        (0x10000000U)
#define CLKCTL4_MEDIAVDDNCLKDIV_BUSY_SHIFT       (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_MEDIAVDDNCLKDIV_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAVDDNCLKDIV_BUSY_SHIFT)) & CLKCTL4_MEDIAVDDNCLKDIV_BUSY_MASK)

#define CLKCTL4_MEDIAVDDNCLKDIV_REQFLAG_MASK     (0x80000000U)
#define CLKCTL4_MEDIAVDDNCLKDIV_REQFLAG_SHIFT    (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_MEDIAVDDNCLKDIV_REQFLAG(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAVDDNCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_MEDIAVDDNCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name MEDIAMAINCLKSEL - Media Main Clock Source Select */
/*! @{ */

#define CLKCTL4_MEDIAMAINCLKSEL_SEL_MASK         (0x3U)
#define CLKCTL4_MEDIAMAINCLKSEL_SEL_SHIFT        (0U)
/*! SEL - Media Main Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd2
 */
#define CLKCTL4_MEDIAMAINCLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAMAINCLKSEL_SEL_SHIFT)) & CLKCTL4_MEDIAMAINCLKSEL_SEL_MASK)
/*! @} */

/*! @name MEDIAMAINCLKDIV - Media Main Clock Divider */
/*! @{ */

#define CLKCTL4_MEDIAMAINCLKDIV_DIV_MASK         (0xFFU)
#define CLKCTL4_MEDIAMAINCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_MEDIAMAINCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAMAINCLKDIV_DIV_SHIFT)) & CLKCTL4_MEDIAMAINCLKDIV_DIV_MASK)

#define CLKCTL4_MEDIAMAINCLKDIV_BUSY_MASK        (0x10000000U)
#define CLKCTL4_MEDIAMAINCLKDIV_BUSY_SHIFT       (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_MEDIAMAINCLKDIV_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAMAINCLKDIV_BUSY_SHIFT)) & CLKCTL4_MEDIAMAINCLKDIV_BUSY_MASK)

#define CLKCTL4_MEDIAMAINCLKDIV_REQFLAG_MASK     (0x80000000U)
#define CLKCTL4_MEDIAMAINCLKDIV_REQFLAG_SHIFT    (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_MEDIAMAINCLKDIV_REQFLAG(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MEDIAMAINCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_MEDIAMAINCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name MDNBASECLKSEL - VDDN_MEDIA Base Clock Source Select */
/*! @{ */

#define CLKCTL4_MDNBASECLKSEL_SEL_MASK           (0x3U)
#define CLKCTL4_MDNBASECLKSEL_SEL_SHIFT          (0U)
/*! SEL - VDDN_MEDIA Base Clock Source Select
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL4_MDNBASECLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MDNBASECLKSEL_SEL_SHIFT)) & CLKCTL4_MDNBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name MD2BASECLKSEL - VDD2_MEDIA Base Clock Source Select */
/*! @{ */

