nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define CLKCTL4_MD2BASECLKSEL_SEL_MASK           (0x3U)
#define CLKCTL4_MD2BASECLKSEL_SEL_SHIFT          (0U)
/*! SEL - Media VDD2 Base Clock Source Select
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL4_MD2BASECLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_MD2BASECLKSEL_SEL_SHIFT)) & CLKCTL4_MD2BASECLKSEL_SEL_MASK)
/*! @} */

/*! @name XSPI2FCLKSEL - XSPI2 Functional Clock Source Select */
/*! @{ */

#define CLKCTL4_XSPI2FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL4_XSPI2FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - XSPI2 Clock Source Select
 *  0b00..baseclk_comn
 *  0b01..audio_pll_pfd1
 *  0b10..fro0_max
 *  0b11..main_pll_pfd3
 */
#define CLKCTL4_XSPI2FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_XSPI2FCLKSEL_SEL_SHIFT)) & CLKCTL4_XSPI2FCLKSEL_SEL_MASK)

#define CLKCTL4_XSPI2FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL4_XSPI2FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for XSPI2 clock.
 *  0b1..Enables mux output for XSPI2 clock.
 */
#define CLKCTL4_XSPI2FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_XSPI2FCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_XSPI2FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name XSPI2FCLKDIV - XSPI2 Functional Clock Divider */
/*! @{ */

#define CLKCTL4_XSPI2FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL4_XSPI2FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_XSPI2FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_XSPI2FCLKDIV_DIV_SHIFT)) & CLKCTL4_XSPI2FCLKDIV_DIV_MASK)

#define CLKCTL4_XSPI2FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL4_XSPI2FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_XSPI2FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_XSPI2FCLKDIV_BUSY_SHIFT)) & CLKCTL4_XSPI2FCLKDIV_BUSY_MASK)

#define CLKCTL4_XSPI2FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL4_XSPI2FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_XSPI2FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_XSPI2FCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_XSPI2FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name USBFCLKSEL - USB0 Functional Clock Source Select */
/*! @{ */

#define CLKCTL4_USBFCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL4_USBFCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Clock Source Select
 *  0b00..wake32k_clk
 *  0b01..1m_lposc
 *  0b10..osc_clk_usb
 *  0b11..Reserved
 */
#define CLKCTL4_USBFCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL4_USBFCLKSEL_SEL_SHIFT)) & CLKCTL4_USBFCLKSEL_SEL_MASK)

#define CLKCTL4_USBFCLKSEL_SEL_EN_MASK           (0x4U)
#define CLKCTL4_USBFCLKSEL_SEL_EN_SHIFT          (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates USB0 clock. It is necessary to read back bit3 with the value of 1 to confirm the clock is already gated then go ahead.
 *  0b1..Enables USB0 clock.
 */
#define CLKCTL4_USBFCLKSEL_SEL_EN(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_USBFCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_USBFCLKSEL_SEL_EN_MASK)

#define CLKCTL4_USBFCLKSEL_GATED_FLAG_MASK       (0x8U)
#define CLKCTL4_USBFCLKSEL_GATED_FLAG_SHIFT      (3U)
/*! GATED_FLAG - Gate Flag
 *  0b0..The USB0 fclk is not gated.
 *  0b1..The USB0 fclk is gated.
 */
#define CLKCTL4_USBFCLKSEL_GATED_FLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_USBFCLKSEL_GATED_FLAG_SHIFT)) & CLKCTL4_USBFCLKSEL_GATED_FLAG_MASK)
/*! @} */

/*! @name EUSBFCLKSEL - USB1 (eUSB) Functional Clock Source Select */
/*! @{ */

#define CLKCTL4_EUSBFCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL4_EUSBFCLKSEL_SEL_SHIFT            (0U)
/*! SEL - USB1 Clock Source Select
 *  0b00..wake32k_clk
 *  0b01..1m_lposc
 *  0b10..osc_clk_eusb
 *  0b11..Reserved
 */
#define CLKCTL4_EUSBFCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL4_EUSBFCLKSEL_SEL_SHIFT)) & CLKCTL4_EUSBFCLKSEL_SEL_MASK)

#define CLKCTL4_EUSBFCLKSEL_SEL_EN_MASK          (0x4U)
#define CLKCTL4_EUSBFCLKSEL_SEL_EN_SHIFT         (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for USB1 functional clock. It is necessary to read back bit3 with the value of 1 to
 *       confirm the clock is already gated then go ahead.
 *  0b1..Enables mux output for USB1 functional clock.
 */
#define CLKCTL4_EUSBFCLKSEL_SEL_EN(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_EUSBFCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_EUSBFCLKSEL_SEL_EN_MASK)

#define CLKCTL4_EUSBFCLKSEL_GATED_FLAG_MASK      (0x8U)
#define CLKCTL4_EUSBFCLKSEL_GATED_FLAG_SHIFT     (3U)
/*! GATED_FLAG - Gate Flag
 *  0b0..The USB1 functional clock is not gated.
 *  0b1..The USB1 functional clock is gated.
 */
#define CLKCTL4_EUSBFCLKSEL_GATED_FLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_EUSBFCLKSEL_GATED_FLAG_SHIFT)) & CLKCTL4_EUSBFCLKSEL_GATED_FLAG_MASK)
/*! @} */

/*! @name SDIO0FCLKSEL - SDIO0 Functional Clock Source Select */
/*! @{ */

#define CLKCTL4_SDIO0FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL4_SDIO0FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - SDIO0 Functional Clock Source Select
 *  0b00..baseclk_mdn
 *  0b01..audio_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd2
 */
#define CLKCTL4_SDIO0FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKSEL_SEL_SHIFT)) & CLKCTL4_SDIO0FCLKSEL_SEL_MASK)

#define CLKCTL4_SDIO0FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL4_SDIO0FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for SD/MMC/SDIO interface 0 clock.
 *  0b1..Enables mux output for SD/MMC/SDIO interface 0 clock.
 */
#define CLKCTL4_SDIO0FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_SDIO0FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SDIO0FCLKDIV - SDIO0 Functional Clock Divider */
/*! @{ */

#define CLKCTL4_SDIO0FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL4_SDIO0FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_SDIO0FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKDIV_DIV_SHIFT)) & CLKCTL4_SDIO0FCLKDIV_DIV_MASK)

