nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name FRAMEBUFFERCONFIG0 - Frame Buffer Configuration */
/*! @{ */

#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT_MASK     (0x7U)
#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT_SHIFT    (0U)
/*! FORMAT - Frame Buffer Format
 *  0b000..None; no frame buffer exists and LCDIF does not produce any output
 *  0b001..A4R4G4B4
 *  0b010..A1R5G5B5
 *  0b011..R5G6B5
 *  0b100..A8R8G8B8
 *  0b101..R8G8B8
 *  0b110..A8R5G6B5
 *  *..
 */
#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_FORMAT_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_FORMAT_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_ENABLE_MASK     (0x8U)
#define LCDIF_FRAMEBUFFERCONFIG0_ENABLE_SHIFT    (3U)
/*! ENABLE - Enable Layer
 *  0b0..Disable
 *  0b1..Enable
 */
#define LCDIF_FRAMEBUFFERCONFIG0_ENABLE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_ENABLE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_ENABLE_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_CLEAR_EN_MASK   (0x20U)
#define LCDIF_FRAMEBUFFERCONFIG0_CLEAR_EN_SHIFT  (5U)
/*! CLEAR_EN - Enable Clear
 *  0b0..Disable
 *  0b1..Enable
 */
#define LCDIF_FRAMEBUFFERCONFIG0_CLEAR_EN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_CLEAR_EN_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_CLEAR_EN_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN_MASK (0x400U)
#define LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN_SHIFT (10U)
/*! COLOR_KEY_EN - Enable Color Keying
 *  0b0..Disable
 *  0b1..Enable
 */
#define LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_COLOR_KEY_EN_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE_MASK    (0x60000U)
#define LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE_SHIFT   (17U)
/*! SWIZZLE - Swizzle for RGB
 *  0b00..ARGB
 *  0b01..RGBA
 *  0b10..ABGR
 *  0b11..BGRA
 */
#define LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_SWIZZLE_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE_MASK (0x80000U)
#define LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE_SHIFT (19U)
/*! UV_SWIZZLE - Swizzle for UV */
#define LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_UV_SWIZZLE_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE_MASK   (0xE00000U)
#define LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE_SHIFT  (21U)
/*! DEC_MODE - Decompression Mode
 *  0b000..Decompression disabled
 *  0b001..Non-Subsample
 *  0b010..Horizontal Subsample
 *  0b011..Horizontal and Vertical Subsample
 *  0b100..ETC2
 *  *..
 */
#define LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_DEC_MODE_MASK)

#define LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE_MASK  (0x7000000U)
#define LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE_SHIFT (24U)
/*! ROT_ANGLE - Rotation Angle
 *  0b000..Sets the rotation angle to 0 degree.
 *  0b010..Sets the rotation angle to 180 degree.
 *  0b100..Flips horizontal
 *  0b101..Flips vertical
 *  *..
 */
#define LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_ROT_ANGLE_MASK)
/*! @} */

/*! @name FRAMEBUFFERADDRESS0 - Frame Buffer Base Address */
/*! @{ */

#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_MASK   (0xFFFFFFFFU)
#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_SHIFT  (0U)
/*! ADDRESS - Starting Address */
#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_SHIFT)) & LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_MASK)
/*! @} */

/*! @name FRAMEBUFFERSTRIDE0 - Frame Buffer Stride */
/*! @{ */

#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_MASK     (0x1FFFFU)
#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_SHIFT    (0U)
/*! STRIDE - Frame Buffer Stride */
#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_SHIFT)) & LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_MASK)
/*! @} */

/*! @name DCTILEINCFG0 - Tile Input Configuration */
/*! @{ */

#define LCDIF_DCTILEINCFG0_TILE_FORMAT_MASK      (0x3U)
#define LCDIF_DCTILEINCFG0_TILE_FORMAT_SHIFT     (0U)
/*! TILE_FORMAT - Tile Input Format
 *  0b00..No tile input. See DcTileInCfg0[TILE_FORMAT1].
 *  0b01..ARGB8888
 *  0b10..YUY2
 *  0b11..NV12
 */
#define LCDIF_DCTILEINCFG0_TILE_FORMAT(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEINCFG0_TILE_FORMAT_SHIFT)) & LCDIF_DCTILEINCFG0_TILE_FORMAT_MASK)

#define LCDIF_DCTILEINCFG0_YUV_STANDARD_MASK     (0x4U)
#define LCDIF_DCTILEINCFG0_YUV_STANDARD_SHIFT    (2U)
/*! YUV_STANDARD - YUV Standard
 *  0b0..BT601
 *  0b1..BT709
 */
#define LCDIF_DCTILEINCFG0_YUV_STANDARD(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEINCFG0_YUV_STANDARD_SHIFT)) & LCDIF_DCTILEINCFG0_YUV_STANDARD_MASK)

#define LCDIF_DCTILEINCFG0_TILE_FORMAT1_MASK     (0x18U)
#define LCDIF_DCTILEINCFG0_TILE_FORMAT1_SHIFT    (3U)
/*! TILE_FORMAT1 - Tile Format 1 */
#define LCDIF_DCTILEINCFG0_TILE_FORMAT1(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEINCFG0_TILE_FORMAT1_SHIFT)) & LCDIF_DCTILEINCFG0_TILE_FORMAT1_MASK)
/*! @} */

/*! @name DCTILEUVFRAMEBUFFERADR0 - Frame Buffer Tiled UV Base Address */
/*! @{ */

#define LCDIF_DCTILEUVFRAMEBUFFERADR0_ADDRESS_MASK (0xFFFFFFFFU)
#define LCDIF_DCTILEUVFRAMEBUFFERADR0_ADDRESS_SHIFT (0U)
/*! ADDRESS - Base Address */
#define LCDIF_DCTILEUVFRAMEBUFFERADR0_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEUVFRAMEBUFFERADR0_ADDRESS_SHIFT)) & LCDIF_DCTILEUVFRAMEBUFFERADR0_ADDRESS_MASK)
/*! @} */

/*! @name DCTILEUVFRAMEBUFFERSTR0 - Frame Buffer Tiled UV Stride */
/*! @{ */

#define LCDIF_DCTILEUVFRAMEBUFFERSTR0_STRIDE_MASK (0xFFFFU)
#define LCDIF_DCTILEUVFRAMEBUFFERSTR0_STRIDE_SHIFT (0U)
/*! STRIDE - Stride */
#define LCDIF_DCTILEUVFRAMEBUFFERSTR0_STRIDE(x)  (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEUVFRAMEBUFFERSTR0_STRIDE_SHIFT)) & LCDIF_DCTILEUVFRAMEBUFFERSTR0_STRIDE_MASK)
/*! @} */

/*! @name FRAMEBUFFERBACKGROUND - Frame Buffer Background */
/*! @{ */

#define LCDIF_FRAMEBUFFERBACKGROUND_BLUE_MASK    (0xFFU)
#define LCDIF_FRAMEBUFFERBACKGROUND_BLUE_SHIFT   (0U)
/*! BLUE - Blue */
#define LCDIF_FRAMEBUFFERBACKGROUND_BLUE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERBACKGROUND_BLUE_SHIFT)) & LCDIF_FRAMEBUFFERBACKGROUND_BLUE_MASK)

#define LCDIF_FRAMEBUFFERBACKGROUND_GREEN_MASK   (0xFF00U)
#define LCDIF_FRAMEBUFFERBACKGROUND_GREEN_SHIFT  (8U)
/*! GREEN - Green */
#define LCDIF_FRAMEBUFFERBACKGROUND_GREEN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERBACKGROUND_GREEN_SHIFT)) & LCDIF_FRAMEBUFFERBACKGROUND_GREEN_MASK)

#define LCDIF_FRAMEBUFFERBACKGROUND_RED_MASK     (0xFF0000U)
#define LCDIF_FRAMEBUFFERBACKGROUND_RED_SHIFT    (16U)
/*! RED - Red */
#define LCDIF_FRAMEBUFFERBACKGROUND_RED(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERBACKGROUND_RED_SHIFT)) & LCDIF_FRAMEBUFFERBACKGROUND_RED_MASK)

#define LCDIF_FRAMEBUFFERBACKGROUND_ALPHA_MASK   (0xFF000000U)
#define LCDIF_FRAMEBUFFERBACKGROUND_ALPHA_SHIFT  (24U)
/*! ALPHA - Alpha */
#define LCDIF_FRAMEBUFFERBACKGROUND_ALPHA(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERBACKGROUND_ALPHA_SHIFT)) & LCDIF_FRAMEBUFFERBACKGROUND_ALPHA_MASK)
/*! @} */

/*! @name FRAMEBUFFERCOLORKEY - Frame Buffer Color Keying Start Address */
/*! @{ */

#define LCDIF_FRAMEBUFFERCOLORKEY_BLUE_MASK      (0xFFU)
#define LCDIF_FRAMEBUFFERCOLORKEY_BLUE_SHIFT     (0U)
/*! BLUE - Blue */
#define LCDIF_FRAMEBUFFERCOLORKEY_BLUE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEY_BLUE_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEY_BLUE_MASK)

#define LCDIF_FRAMEBUFFERCOLORKEY_GREEN_MASK     (0xFF00U)
#define LCDIF_FRAMEBUFFERCOLORKEY_GREEN_SHIFT    (8U)
/*! GREEN - Green */
#define LCDIF_FRAMEBUFFERCOLORKEY_GREEN(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEY_GREEN_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEY_GREEN_MASK)

#define LCDIF_FRAMEBUFFERCOLORKEY_RED_MASK       (0xFF0000U)
#define LCDIF_FRAMEBUFFERCOLORKEY_RED_SHIFT      (16U)
/*! RED - Red */
#define LCDIF_FRAMEBUFFERCOLORKEY_RED(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEY_RED_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEY_RED_MASK)

#define LCDIF_FRAMEBUFFERCOLORKEY_ALPHA_MASK     (0xFF000000U)
#define LCDIF_FRAMEBUFFERCOLORKEY_ALPHA_SHIFT    (24U)
/*! ALPHA - Alpha */
#define LCDIF_FRAMEBUFFERCOLORKEY_ALPHA(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEY_ALPHA_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEY_ALPHA_MASK)
/*! @} */

/*! @name FRAMEBUFFERCOLORKEYHIGH - Frame Buffer Color Key End Address */
/*! @{ */

#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_BLUE_MASK  (0xFFU)
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_BLUE_SHIFT (0U)
/*! BLUE - Blue */
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_BLUE(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEYHIGH_BLUE_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEYHIGH_BLUE_MASK)

#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_GREEN_MASK (0xFF00U)
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_GREEN_SHIFT (8U)
/*! GREEN - Green */
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_GREEN(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEYHIGH_GREEN_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEYHIGH_GREEN_MASK)

