nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name CFG_TX_GAP - Configure Gap Clock Periods */
/*! @{ */

#define MIPI_DSI_HOST_CFG_TX_GAP_CFG_TX_GAP_MASK (0xFFU)
#define MIPI_DSI_HOST_CFG_TX_GAP_CFG_TX_GAP_SHIFT (0U)
/*! CFG_TX_GAP - Configure Gap Clock Periods */
#define MIPI_DSI_HOST_CFG_TX_GAP_CFG_TX_GAP(x)   (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_TX_GAP_CFG_TX_GAP_SHIFT)) & MIPI_DSI_HOST_CFG_TX_GAP_CFG_TX_GAP_MASK)
/*! @} */

/*! @name CFG_AUTOINSERT_EOTP - Configure Autoinsert EOTP */
/*! @{ */

#define MIPI_DSI_HOST_CFG_AUTOINSERT_EOTP_CFG_AUTOINSERT_EOTP_MASK (0x1U)
#define MIPI_DSI_HOST_CFG_AUTOINSERT_EOTP_CFG_AUTOINSERT_EOTP_SHIFT (0U)
/*! CFG_AUTOINSERT_EOTP - Configure Autoinsert EOTP
 *  0b0..EOTP is not automatically inserted
 *  0b1..EOTP is automatically inserted
 */
#define MIPI_DSI_HOST_CFG_AUTOINSERT_EOTP_CFG_AUTOINSERT_EOTP(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_AUTOINSERT_EOTP_CFG_AUTOINSERT_EOTP_SHIFT)) & MIPI_DSI_HOST_CFG_AUTOINSERT_EOTP_CFG_AUTOINSERT_EOTP_MASK)
/*! @} */

/*! @name CFG_EXTRA_CMDS_AFTER_EOTP - Configure Extra Commands after EOTP */
/*! @{ */

#define MIPI_DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP_CFG_EXTRA_CMDS_AFTER_EOTP_MASK (0xFFU)
#define MIPI_DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP_CFG_EXTRA_CMDS_AFTER_EOTP_SHIFT (0U)
/*! CFG_EXTRA_CMDS_AFTER_EOTP - Configure Extra Commands after EOTP */
#define MIPI_DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP_CFG_EXTRA_CMDS_AFTER_EOTP(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP_CFG_EXTRA_CMDS_AFTER_EOTP_SHIFT)) & MIPI_DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP_CFG_EXTRA_CMDS_AFTER_EOTP_MASK)
/*! @} */

/*! @name CFG_HTX_TO_COUNT - Configure High Speed Tx Timeout Count */
/*! @{ */

#define MIPI_DSI_HOST_CFG_HTX_TO_COUNT_CFG_HTX_TO_COUNT_MASK (0xFFFFFFU)
#define MIPI_DSI_HOST_CFG_HTX_TO_COUNT_CFG_HTX_TO_COUNT_SHIFT (0U)
/*! CFG_HTX_TO_COUNT - Configure High Speed Tx Timeout Count */
#define MIPI_DSI_HOST_CFG_HTX_TO_COUNT_CFG_HTX_TO_COUNT(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_HTX_TO_COUNT_CFG_HTX_TO_COUNT_SHIFT)) & MIPI_DSI_HOST_CFG_HTX_TO_COUNT_CFG_HTX_TO_COUNT_MASK)
/*! @} */

/*! @name CFG_LRX_H_TO_COUNT - Configure Low Power Rx Timeout Count */
/*! @{ */

#define MIPI_DSI_HOST_CFG_LRX_H_TO_COUNT_CFG_LRX_H_TO_COUNT_MASK (0xFFFFFFU)
#define MIPI_DSI_HOST_CFG_LRX_H_TO_COUNT_CFG_LRX_H_TO_COUNT_SHIFT (0U)
/*! CFG_LRX_H_TO_COUNT - Configure Low Power Rx Timeout Count */
#define MIPI_DSI_HOST_CFG_LRX_H_TO_COUNT_CFG_LRX_H_TO_COUNT(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_LRX_H_TO_COUNT_CFG_LRX_H_TO_COUNT_SHIFT)) & MIPI_DSI_HOST_CFG_LRX_H_TO_COUNT_CFG_LRX_H_TO_COUNT_MASK)
/*! @} */

/*! @name CFG_BTA_H_TO_COUNT - Configure Bus Turn Around Timeout Count */
/*! @{ */

#define MIPI_DSI_HOST_CFG_BTA_H_TO_COUNT_CFG_BTA_H_TO_COUNT_MASK (0xFFFFFFU)
#define MIPI_DSI_HOST_CFG_BTA_H_TO_COUNT_CFG_BTA_H_TO_COUNT_SHIFT (0U)
/*! CFG_BTA_H_TO_COUNT - Configure Bus Turn Around Timeout Count */
#define MIPI_DSI_HOST_CFG_BTA_H_TO_COUNT_CFG_BTA_H_TO_COUNT(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_BTA_H_TO_COUNT_CFG_BTA_H_TO_COUNT_SHIFT)) & MIPI_DSI_HOST_CFG_BTA_H_TO_COUNT_CFG_BTA_H_TO_COUNT_MASK)
/*! @} */

/*! @name CFG_TWAKEUP - Configure Twakeup */
/*! @{ */

#define MIPI_DSI_HOST_CFG_TWAKEUP_CFG_TWAKEUP_MASK (0x7FFFFU)
#define MIPI_DSI_HOST_CFG_TWAKEUP_CFG_TWAKEUP_SHIFT (0U)
/*! CFG_TWAKEUP - DPHY Twakeup Timing Parameter */
#define MIPI_DSI_HOST_CFG_TWAKEUP_CFG_TWAKEUP(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_TWAKEUP_CFG_TWAKEUP_SHIFT)) & MIPI_DSI_HOST_CFG_TWAKEUP_CFG_TWAKEUP_MASK)
/*! @} */

/*! @name CFG_STATUS_OUT - Configure Status Out */
/*! @{ */

#define MIPI_DSI_HOST_CFG_STATUS_OUT_CFG_STATUS_OUT_MASK (0xFFFFFFFFU)
#define MIPI_DSI_HOST_CFG_STATUS_OUT_CFG_STATUS_OUT_SHIFT (0U)
/*! CFG_STATUS_OUT - Configure Status Out */
#define MIPI_DSI_HOST_CFG_STATUS_OUT_CFG_STATUS_OUT(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_CFG_STATUS_OUT_CFG_STATUS_OUT_SHIFT)) & MIPI_DSI_HOST_CFG_STATUS_OUT_CFG_STATUS_OUT_MASK)
/*! @} */

/*! @name RX_ERROR_STATUS - Receive Error Status */
/*! @{ */

#define MIPI_DSI_HOST_RX_ERROR_STATUS_RX_ERROR_STATUS_MASK (0x7FFU)
#define MIPI_DSI_HOST_RX_ERROR_STATUS_RX_ERROR_STATUS_SHIFT (0U)
/*! RX_ERROR_STATUS - Receive Error Status */
#define MIPI_DSI_HOST_RX_ERROR_STATUS_RX_ERROR_STATUS(x) (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_RX_ERROR_STATUS_RX_ERROR_STATUS_SHIFT)) & MIPI_DSI_HOST_RX_ERROR_STATUS_RX_ERROR_STATUS_MASK)
/*! @} */

/*! @name ULPS_ENABLE - ULPS Enable */
/*! @{ */

#define MIPI_DSI_HOST_ULPS_ENABLE_EN0_MASK       (0x1U)
#define MIPI_DSI_HOST_ULPS_ENABLE_EN0_SHIFT      (0U)
/*! EN0 - Enable Clock Lane
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MIPI_DSI_HOST_ULPS_ENABLE_EN0(x)         (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ENABLE_EN0_SHIFT)) & MIPI_DSI_HOST_ULPS_ENABLE_EN0_MASK)

#define MIPI_DSI_HOST_ULPS_ENABLE_EN1_MASK       (0x2U)
#define MIPI_DSI_HOST_ULPS_ENABLE_EN1_SHIFT      (1U)
/*! EN1 - Enable Data Lane 0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MIPI_DSI_HOST_ULPS_ENABLE_EN1(x)         (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ENABLE_EN1_SHIFT)) & MIPI_DSI_HOST_ULPS_ENABLE_EN1_MASK)

#define MIPI_DSI_HOST_ULPS_ENABLE_EN2_MASK       (0x4U)
#define MIPI_DSI_HOST_ULPS_ENABLE_EN2_SHIFT      (2U)
/*! EN2 - Enable Data Lane 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MIPI_DSI_HOST_ULPS_ENABLE_EN2(x)         (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ENABLE_EN2_SHIFT)) & MIPI_DSI_HOST_ULPS_ENABLE_EN2_MASK)

#define MIPI_DSI_HOST_ULPS_ENABLE_EN3_MASK       (0x8U)
#define MIPI_DSI_HOST_ULPS_ENABLE_EN3_SHIFT      (3U)
/*! EN3 - Enable Data Lane 2
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MIPI_DSI_HOST_ULPS_ENABLE_EN3(x)         (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ENABLE_EN3_SHIFT)) & MIPI_DSI_HOST_ULPS_ENABLE_EN3_MASK)

#define MIPI_DSI_HOST_ULPS_ENABLE_EN4_MASK       (0x10U)
#define MIPI_DSI_HOST_ULPS_ENABLE_EN4_SHIFT      (4U)
/*! EN4 - Enable Data Lane 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define MIPI_DSI_HOST_ULPS_ENABLE_EN4(x)         (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ENABLE_EN4_SHIFT)) & MIPI_DSI_HOST_ULPS_ENABLE_EN4_MASK)
/*! @} */

/*! @name ULPS_ACTIVE - ULPS Active */
/*! @{ */

#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE0_MASK   (0x1U)
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE0_SHIFT  (0U)
/*! ACTIVE0 - Clock Lane ULPS Active
 *  0b0..ULPS inactive
 *  0b1..ULPS active
 */
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE0(x)     (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE0_SHIFT)) & MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE0_MASK)

#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE1_MASK   (0x2U)
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE1_SHIFT  (1U)
/*! ACTIVE1 - Data Lane 0 ULPS ACTIVE
 *  0b0..ULPS inactive
 *  0b1..ULPS active
 */
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE1(x)     (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE1_SHIFT)) & MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE1_MASK)

#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE2_MASK   (0x4U)
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE2_SHIFT  (2U)
/*! ACTIVE2 - Data Lane 1 ULPS ACTIVE
 *  0b0..ULPS inactive
 *  0b1..ULPS active
 */
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE2(x)     (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE2_SHIFT)) & MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE2_MASK)

#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE3_MASK   (0x8U)
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE3_SHIFT  (3U)
/*! ACTIVE3 - Data Lane 2 ULPS ACTIVE
 *  0b0..ULPS inactive
 *  0b1..ULPS active
 */
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE3(x)     (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE3_SHIFT)) & MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE3_MASK)

#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE4_MASK   (0x10U)
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE4_SHIFT  (4U)
/*! ACTIVE4 - Data Lane 3 ULPS ACTIVE
 *  0b0..ULPS inactive
 *  0b1..ULPS active
 */
#define MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE4(x)     (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE4_SHIFT)) & MIPI_DSI_HOST_ULPS_ACTIVE_ACTIVE4_MASK)
/*! @} */

/*! @name HS_MODE_ENABLE - High Speed Mode Enable */
/*! @{ */

#define MIPI_DSI_HOST_HS_MODE_ENABLE_ENABLE_MASK (0x1U)
#define MIPI_DSI_HOST_HS_MODE_ENABLE_ENABLE_SHIFT (0U)
/*! ENABLE - Enable
 *  0b0..All transmissions in Low Power Data transmission mode.
 *  0b1..All transmissions in High Speed mode.
 */
#define MIPI_DSI_HOST_HS_MODE_ENABLE_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << MIPI_DSI_HOST_HS_MODE_ENABLE_ENABLE_SHIFT)) & MIPI_DSI_HOST_HS_MODE_ENABLE_ENABLE_MASK)
/*! @} */

/*! @name HOST_TURNAROUND - Host Turnaround */
/*! @{ */

