nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define PMC_PDSLEEPCFG0_DCDC_VSEL_MASK           (0x2000U)
#define PMC_PDSLEEPCFG0_DCDC_VSEL_SHIFT          (13U)
/*! DCDC_VSEL - DCDC Voltage Select
 *  0b1..Selects DCDCVSEL[VSEL1] level
 *  0b0..Selects DCDCVSEL[VSEL0] level
 */
#define PMC_PDSLEEPCFG0_DCDC_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_DCDC_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_DCDC_VSEL_MASK)

#define PMC_PDSLEEPCFG0_LDO1_MODE_MASK           (0xC000U)
#define PMC_PDSLEEPCFG0_LDO1_MODE_SHIFT          (14U)
/*! LDO1_MODE - LDO VDD1 Regulator Mode
 *  0b10, 0b11..Low-power mode
 *  0b01..High-power mode
 *  0b00..Bypass mode
 */
#define PMC_PDSLEEPCFG0_LDO1_MODE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO1_MODE_SHIFT)) & PMC_PDSLEEPCFG0_LDO1_MODE_MASK)

#define PMC_PDSLEEPCFG0_LDO1_VSEL_MASK           (0x30000U)
#define PMC_PDSLEEPCFG0_LDO1_VSEL_SHIFT          (16U)
/*! LDO1_VSEL - LDO VDD1 Voltage Select
 *  0b00..Selects LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level
 *  0b01..Selects LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level
 *  0b10..Selects LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level
 *  0b11..Selects LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level
 */
#define PMC_PDSLEEPCFG0_LDO1_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO1_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_LDO1_VSEL_MASK)

#define PMC_PDSLEEPCFG0_LDO2_MODE_MASK           (0xC0000U)
#define PMC_PDSLEEPCFG0_LDO2_MODE_SHIFT          (18U)
/*! LDO2_MODE - LDO VDD2 Regulator Mode
 *  0b10, 0b11..Low-power mode
 *  0b01..High-power mode
 *  0b00..Bypass mode
 */
#define PMC_PDSLEEPCFG0_LDO2_MODE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO2_MODE_SHIFT)) & PMC_PDSLEEPCFG0_LDO2_MODE_MASK)

#define PMC_PDSLEEPCFG0_LDO2_VSEL_MASK           (0x300000U)
#define PMC_PDSLEEPCFG0_LDO2_VSEL_SHIFT          (20U)
/*! LDO2_VSEL - LDO VDD2 Voltage Select
 *  0b00..Selects LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level
 *  0b01..Selects LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level
 *  0b10..Selects LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level
 *  0b11..Selects LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level
 */
#define PMC_PDSLEEPCFG0_LDO2_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO2_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_LDO2_VSEL_MASK)

#define PMC_PDSLEEPCFG0_RBB1_PD_MASK             (0x400000U)
#define PMC_PDSLEEPCFG0_RBB1_PD_SHIFT            (22U)
/*! RBB1_PD - Power Down RBB in VDD1 Domain
 *  0b0..If PDSLEEPCFG0[AFBB1_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBB1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBB1_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBB1_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBB1_PD_MASK            (0x800000U)
#define PMC_PDSLEEPCFG0_AFBB1_PD_SHIFT           (23U)
/*! AFBB1_PD - Power Down AFBB in VDD1 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG0_AFBB1_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBB1_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBB1_PD_MASK)

#define PMC_PDSLEEPCFG0_RBB2_PD_MASK             (0x1000000U)
#define PMC_PDSLEEPCFG0_RBB2_PD_SHIFT            (24U)
/*! RBB2_PD - Power Down RBB in VDD2 Domain
 *  0b1..Power down
 *  0b0..If PDSLEEPCFG0[AFBB2_PD] = 1, power on. Else power down
 */
#define PMC_PDSLEEPCFG0_RBB2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBB2_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBB2_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBB2_PD_MASK            (0x2000000U)
#define PMC_PDSLEEPCFG0_AFBB2_PD_SHIFT           (25U)
/*! AFBB2_PD - Power Down AFBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_AFBB2_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBB2_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBB2_PD_MASK)

#define PMC_PDSLEEPCFG0_RBBN_PD_MASK             (0x4000000U)
#define PMC_PDSLEEPCFG0_RBBN_PD_SHIFT            (26U)
/*! RBBN_PD - Power Down RBB in VDDN Domain
 *  0b0..If PDSLEEPCFG0[AFBBN_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBBN_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBBN_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBBN_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBBN_PD_MASK            (0x8000000U)
#define PMC_PDSLEEPCFG0_AFBBN_PD_SHIFT           (27U)
/*! AFBBN_PD - Power Down AFBB in VDDN Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG0_AFBBN_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBBN_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBBN_PD_MASK)

#define PMC_PDSLEEPCFG0_RBBSR1_PD_MASK           (0x10000000U)
#define PMC_PDSLEEPCFG0_RBBSR1_PD_SHIFT          (28U)
/*! RBBSR1_PD - Power Down SRAM RBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBBSR1_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBBSR1_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBBSR1_PD_MASK)

#define PMC_PDSLEEPCFG0_RBBSR2_PD_MASK           (0x20000000U)
#define PMC_PDSLEEPCFG0_RBBSR2_PD_SHIFT          (29U)
/*! RBBSR2_PD - Power Down SRAM RBB in VDD2 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG0_RBBSR2_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBBSR2_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBBSR2_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBBSR2_PD_MASK          (0x80000000U)
#define PMC_PDSLEEPCFG0_AFBBSR2_PD_SHIFT         (31U)
/*! AFBBSR2_PD - Power Down SRAM AFBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_AFBBSR2_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBBSR2_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBBSR2_PD_MASK)
/*! @} */

/*! @name PDSLEEPCFG1 - PD Sleep Configuration 1 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG1_TEMP_PD_MASK             (0x1U)
#define PMC_PDSLEEPCFG1_TEMP_PD_SHIFT            (0U)
/*! TEMP_PD - PMC Temperature Sensor Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG1_TEMP_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_TEMP_PD_SHIFT)) & PMC_PDSLEEPCFG1_TEMP_PD_MASK)

#define PMC_PDSLEEPCFG1_PMCREF_LP_MASK           (0x2U)
#define PMC_PDSLEEPCFG1_PMCREF_LP_SHIFT          (1U)
/*! PMCREF_LP - PMC References Low Power
 *  0b1..Low-power mode if not overridden by any *_PD bits
 *  0b0..High-power mode
 */
#define PMC_PDSLEEPCFG1_PMCREF_LP(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PMCREF_LP_SHIFT)) & PMC_PDSLEEPCFG1_PMCREF_LP_MASK)

#define PMC_PDSLEEPCFG1_HVD1V8_PD_MASK           (0x4U)
#define PMC_PDSLEEPCFG1_HVD1V8_PD_SHIFT          (2U)
/*! HVD1V8_PD - HVD VDD1V8 Power Down
 *  0b1..Power down
 *  0b0..Power on. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 */
#define PMC_PDSLEEPCFG1_HVD1V8_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_HVD1V8_PD_SHIFT)) & PMC_PDSLEEPCFG1_HVD1V8_PD_MASK)

#define PMC_PDSLEEPCFG1_POR1_LP_MASK             (0x8U)
#define PMC_PDSLEEPCFG1_POR1_LP_SHIFT            (3U)
/*! POR1_LP - POR Low Power in VDD1 Domain
 *  0b1..Low-power mode
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 */
#define PMC_PDSLEEPCFG1_POR1_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_POR1_LP_SHIFT)) & PMC_PDSLEEPCFG1_POR1_LP_MASK)

#define PMC_PDSLEEPCFG1_LVD1_LP_MASK             (0x10U)
#define PMC_PDSLEEPCFG1_LVD1_LP_SHIFT            (4U)
/*! LVD1_LP - LVD Low power in VDD1 Domain
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 *  0b1..Low-power mode
 */
#define PMC_PDSLEEPCFG1_LVD1_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_LVD1_LP_SHIFT)) & PMC_PDSLEEPCFG1_LVD1_LP_MASK)

#define PMC_PDSLEEPCFG1_HVD1_PD_MASK             (0x20U)
#define PMC_PDSLEEPCFG1_HVD1_PD_SHIFT            (5U)
/*! HVD1_PD - HVD Power Down in VDD1 Domain
 *  0b1..Power down
 *  0b0..Power on. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 */
#define PMC_PDSLEEPCFG1_HVD1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_HVD1_PD_SHIFT)) & PMC_PDSLEEPCFG1_HVD1_PD_MASK)

#define PMC_PDSLEEPCFG1_AGDET1_PD_MASK           (0x40U)
#define PMC_PDSLEEPCFG1_AGDET1_PD_SHIFT          (6U)
/*! AGDET1_PD - AGDET Power Down in VDD1 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG1_AGDET1_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_AGDET1_PD_SHIFT)) & PMC_PDSLEEPCFG1_AGDET1_PD_MASK)

#define PMC_PDSLEEPCFG1_POR2_LP_MASK             (0x80U)
#define PMC_PDSLEEPCFG1_POR2_LP_SHIFT            (7U)
/*! POR2_LP - POR Low power in VDD2 Domain
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 *  0b1..Low-power mode
 */
#define PMC_PDSLEEPCFG1_POR2_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_POR2_LP_SHIFT)) & PMC_PDSLEEPCFG1_POR2_LP_MASK)

#define PMC_PDSLEEPCFG1_LVD2_LP_MASK             (0x100U)
#define PMC_PDSLEEPCFG1_LVD2_LP_SHIFT            (8U)
/*! LVD2_LP - LVD Low power in VDD2 Domain
 *  0b1..Low-power mode
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 */
#define PMC_PDSLEEPCFG1_LVD2_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_LVD2_LP_SHIFT)) & PMC_PDSLEEPCFG1_LVD2_LP_MASK)

#define PMC_PDSLEEPCFG1_HVD2_PD_MASK             (0x200U)
#define PMC_PDSLEEPCFG1_HVD2_PD_SHIFT            (9U)
/*! HVD2_PD - HVD Power Down in VDD2 Domain
 *  0b0..Power on. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG1_HVD2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_HVD2_PD_SHIFT)) & PMC_PDSLEEPCFG1_HVD2_PD_MASK)

#define PMC_PDSLEEPCFG1_AGDET2_PD_MASK           (0x400U)
#define PMC_PDSLEEPCFG1_AGDET2_PD_SHIFT          (10U)
/*! AGDET2_PD - AGDET Power Down in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG1_AGDET2_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_AGDET2_PD_SHIFT)) & PMC_PDSLEEPCFG1_AGDET2_PD_MASK)

#define PMC_PDSLEEPCFG1_PORN_LP_MASK             (0x800U)
#define PMC_PDSLEEPCFG1_PORN_LP_SHIFT            (11U)
/*! PORN_LP - POR Low Power in VDDN Domain
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 *  0b1..Low-power mode
 */
#define PMC_PDSLEEPCFG1_PORN_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_PORN_LP_SHIFT)) & PMC_PDSLEEPCFG1_PORN_LP_MASK)

#define PMC_PDSLEEPCFG1_LVDN_LP_MASK             (0x1000U)
#define PMC_PDSLEEPCFG1_LVDN_LP_SHIFT            (12U)
/*! LVDN_LP - LVD Low power in VDDN Domain
 *  0b0..High-power mode. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 *  0b1..Low-power mode
 */
#define PMC_PDSLEEPCFG1_LVDN_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_LVDN_LP_SHIFT)) & PMC_PDSLEEPCFG1_LVDN_LP_MASK)

#define PMC_PDSLEEPCFG1_HVDN_PD_MASK             (0x2000U)
#define PMC_PDSLEEPCFG1_HVDN_PD_SHIFT            (13U)
/*! HVDN_PD - HVD Power Down in VDDN Domain
 *  0b1..Power down
 *  0b0..Power on. In this case the aggregated PDCFGSTATUS1[PMCREF_LP] bit will be in high-power mode
 */
#define PMC_PDSLEEPCFG1_HVDN_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_HVDN_PD_SHIFT)) & PMC_PDSLEEPCFG1_HVDN_PD_MASK)

#define PMC_PDSLEEPCFG1_OTP_PD_MASK              (0x8000U)
#define PMC_PDSLEEPCFG1_OTP_PD_SHIFT             (15U)
/*! OTP_PD - OTP Power Down in VDD2 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG1_OTP_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_OTP_PD_SHIFT)) & PMC_PDSLEEPCFG1_OTP_PD_MASK)

#define PMC_PDSLEEPCFG1_ROM_PD_MASK              (0x10000U)
#define PMC_PDSLEEPCFG1_ROM_PD_SHIFT             (16U)
/*! ROM_PD - ROM Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG1_ROM_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_ROM_PD_SHIFT)) & PMC_PDSLEEPCFG1_ROM_PD_MASK)

#define PMC_PDSLEEPCFG1_SRAMSLEEP_MASK           (0x80000000U)
#define PMC_PDSLEEPCFG1_SRAMSLEEP_SHIFT          (31U)
/*! SRAMSLEEP - SRAM Sleep Mode
 *  0b0..Normal
 *  0b1..Sleep
 */
#define PMC_PDSLEEPCFG1_SRAMSLEEP(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG1_SRAMSLEEP_SHIFT)) & PMC_PDSLEEPCFG1_SRAMSLEEP_MASK)
/*! @} */

/*! @name PDSLEEPCFG2 - PD Sleep Configuration 2 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG2_SRAM0_MASK               (0x1U)
#define PMC_PDSLEEPCFG2_SRAM0_SHIFT              (0U)
/*! SRAM0 - RAM Partition 0 Array Power Down
 *  0b1..Powers down RAM Partition 0 array and periphery
 *  0b0..Powers on RAM Partition 0 array
 */
#define PMC_PDSLEEPCFG2_SRAM0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM0_SHIFT)) & PMC_PDSLEEPCFG2_SRAM0_MASK)

#define PMC_PDSLEEPCFG2_SRAM1_MASK               (0x2U)
#define PMC_PDSLEEPCFG2_SRAM1_SHIFT              (1U)
/*! SRAM1 - RAM Partition 1 Array Power Down
 *  0b1..Powers down RAM Partition 1 array and periphery
 *  0b0..Powers on RAM Partition 1 array
 */
#define PMC_PDSLEEPCFG2_SRAM1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM1_SHIFT)) & PMC_PDSLEEPCFG2_SRAM1_MASK)

