nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define PMC_PDSLEEPCFG2_SRAM17_MASK              (0x20000U)
#define PMC_PDSLEEPCFG2_SRAM17_SHIFT             (17U)
/*! SRAM17 - RAM Partition 17 Array Power Down
 *  0b1..Powers down RAM Partition 17 array and periphery
 *  0b0..Powers on RAM Partition 17 array
 */
#define PMC_PDSLEEPCFG2_SRAM17(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM17_SHIFT)) & PMC_PDSLEEPCFG2_SRAM17_MASK)

#define PMC_PDSLEEPCFG2_SRAM18_MASK              (0x40000U)
#define PMC_PDSLEEPCFG2_SRAM18_SHIFT             (18U)
/*! SRAM18 - RAM Partition 18 Array Power Down
 *  0b1..Powers down RAM Partition 18 array and periphery
 *  0b0..Powers on RAM Partition 18 array
 */
#define PMC_PDSLEEPCFG2_SRAM18(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM18_SHIFT)) & PMC_PDSLEEPCFG2_SRAM18_MASK)

#define PMC_PDSLEEPCFG2_SRAM19_MASK              (0x80000U)
#define PMC_PDSLEEPCFG2_SRAM19_SHIFT             (19U)
/*! SRAM19 - RAM Partition 19 Array Power Down
 *  0b1..Powers down RAM Partition 19 array and periphery
 *  0b0..Powers on RAM Partition 19 array
 */
#define PMC_PDSLEEPCFG2_SRAM19(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM19_SHIFT)) & PMC_PDSLEEPCFG2_SRAM19_MASK)

#define PMC_PDSLEEPCFG2_SRAM20_MASK              (0x100000U)
#define PMC_PDSLEEPCFG2_SRAM20_SHIFT             (20U)
/*! SRAM20 - RAM Partition 20 Array Power Down
 *  0b1..Powers down RAM Partition 20 array and periphery
 *  0b0..Powers on RAM Partition 20 array
 */
#define PMC_PDSLEEPCFG2_SRAM20(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM20_SHIFT)) & PMC_PDSLEEPCFG2_SRAM20_MASK)

#define PMC_PDSLEEPCFG2_SRAM21_MASK              (0x200000U)
#define PMC_PDSLEEPCFG2_SRAM21_SHIFT             (21U)
/*! SRAM21 - RAM Partition 21 Array Power Down
 *  0b1..Powers down RAM Partition 21 array and periphery
 *  0b0..Powers on RAM Partition 21 array
 */
#define PMC_PDSLEEPCFG2_SRAM21(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM21_SHIFT)) & PMC_PDSLEEPCFG2_SRAM21_MASK)

#define PMC_PDSLEEPCFG2_SRAM22_MASK              (0x400000U)
#define PMC_PDSLEEPCFG2_SRAM22_SHIFT             (22U)
/*! SRAM22 - RAM Partition 22 Array Power Down
 *  0b1..Powers down RAM Partition 22 array and periphery
 *  0b0..Powers on RAM Partition 22 array
 */
#define PMC_PDSLEEPCFG2_SRAM22(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM22_SHIFT)) & PMC_PDSLEEPCFG2_SRAM22_MASK)

#define PMC_PDSLEEPCFG2_SRAM23_MASK              (0x800000U)
#define PMC_PDSLEEPCFG2_SRAM23_SHIFT             (23U)
/*! SRAM23 - RAM Partition 23 Array Power Down
 *  0b1..Powers down RAM Partition 23 array and periphery
 *  0b0..Powers on RAM Partition 23 array
 */
#define PMC_PDSLEEPCFG2_SRAM23(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM23_SHIFT)) & PMC_PDSLEEPCFG2_SRAM23_MASK)

#define PMC_PDSLEEPCFG2_SRAM24_MASK              (0x1000000U)
#define PMC_PDSLEEPCFG2_SRAM24_SHIFT             (24U)
/*! SRAM24 - RAM Partition 24 Array Power Down
 *  0b1..Powers down RAM Partition 24 array and periphery
 *  0b0..Powers on RAM Partition 24 array
 */
#define PMC_PDSLEEPCFG2_SRAM24(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM24_SHIFT)) & PMC_PDSLEEPCFG2_SRAM24_MASK)

#define PMC_PDSLEEPCFG2_SRAM25_MASK              (0x2000000U)
#define PMC_PDSLEEPCFG2_SRAM25_SHIFT             (25U)
/*! SRAM25 - RAM Partition 25 Array Power Down
 *  0b1..Powers down RAM Partition 25 array and periphery
 *  0b0..Powers on RAM Partition 25 array
 */
#define PMC_PDSLEEPCFG2_SRAM25(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM25_SHIFT)) & PMC_PDSLEEPCFG2_SRAM25_MASK)

#define PMC_PDSLEEPCFG2_SRAM26_MASK              (0x4000000U)
#define PMC_PDSLEEPCFG2_SRAM26_SHIFT             (26U)
/*! SRAM26 - RAM Partition 26 Array Power Down
 *  0b1..Powers down RAM Partition 26 array and periphery
 *  0b0..Powers on RAM Partition 26 array
 */
#define PMC_PDSLEEPCFG2_SRAM26(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM26_SHIFT)) & PMC_PDSLEEPCFG2_SRAM26_MASK)

#define PMC_PDSLEEPCFG2_SRAM27_MASK              (0x8000000U)
#define PMC_PDSLEEPCFG2_SRAM27_SHIFT             (27U)
/*! SRAM27 - RAM Partition 27 Array Power Down
 *  0b1..Powers down RAM Partition 27 array and periphery
 *  0b0..Powers on RAM Partition 27 array
 */
#define PMC_PDSLEEPCFG2_SRAM27(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM27_SHIFT)) & PMC_PDSLEEPCFG2_SRAM27_MASK)

#define PMC_PDSLEEPCFG2_SRAM28_MASK              (0x10000000U)
#define PMC_PDSLEEPCFG2_SRAM28_SHIFT             (28U)
/*! SRAM28 - RAM Partition 28 Array Power Down
 *  0b1..Powers down RAM Partition 28 array and periphery
 *  0b0..Powers on RAM Partition 28 array
 */
#define PMC_PDSLEEPCFG2_SRAM28(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM28_SHIFT)) & PMC_PDSLEEPCFG2_SRAM28_MASK)

#define PMC_PDSLEEPCFG2_SRAM29_MASK              (0x20000000U)
#define PMC_PDSLEEPCFG2_SRAM29_SHIFT             (29U)
/*! SRAM29 - RAM Partition 29 Array Power Down
 *  0b1..Powers down RAM Partition 29 array and periphery
 *  0b0..Powers on RAM Partition 29 array
 */
#define PMC_PDSLEEPCFG2_SRAM29(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM29_SHIFT)) & PMC_PDSLEEPCFG2_SRAM29_MASK)
/*! @} */

/*! @name PDSLEEPCFG3 - PD Sleep Configuration 3 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG3_SRAM0_MASK               (0x1U)
#define PMC_PDSLEEPCFG3_SRAM0_SHIFT              (0U)
/*! SRAM0 - RAM Partition 0 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM0_SHIFT)) & PMC_PDSLEEPCFG3_SRAM0_MASK)

#define PMC_PDSLEEPCFG3_SRAM1_MASK               (0x2U)
#define PMC_PDSLEEPCFG3_SRAM1_SHIFT              (1U)
/*! SRAM1 - RAM Partition 1 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM1_SHIFT)) & PMC_PDSLEEPCFG3_SRAM1_MASK)

#define PMC_PDSLEEPCFG3_SRAM2_MASK               (0x4U)
#define PMC_PDSLEEPCFG3_SRAM2_SHIFT              (2U)
/*! SRAM2 - RAM Partition 2 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM2_SHIFT)) & PMC_PDSLEEPCFG3_SRAM2_MASK)

#define PMC_PDSLEEPCFG3_SRAM3_MASK               (0x8U)
#define PMC_PDSLEEPCFG3_SRAM3_SHIFT              (3U)
/*! SRAM3 - RAM Partition 3 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM3_SHIFT)) & PMC_PDSLEEPCFG3_SRAM3_MASK)

#define PMC_PDSLEEPCFG3_SRAM4_MASK               (0x10U)
#define PMC_PDSLEEPCFG3_SRAM4_SHIFT              (4U)
/*! SRAM4 - RAM Partition 4 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM4(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM4_SHIFT)) & PMC_PDSLEEPCFG3_SRAM4_MASK)

