nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define PMC_PDCFGSTATUS4_PNG_MASK                (0x20U)
#define PMC_PDCFGSTATUS4_PNG_SHIFT               (5U)
/*! PNG - PNGDEC RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_PNG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_PNG_SHIFT)) & PMC_PDCFGSTATUS4_PNG_MASK)

#define PMC_PDCFGSTATUS4_MIPI_MASK               (0x40U)
#define PMC_PDCFGSTATUS4_MIPI_SHIFT              (6U)
/*! MIPI - MIPI PHY RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_MIPI(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_MIPI_SHIFT)) & PMC_PDCFGSTATUS4_MIPI_MASK)

#define PMC_PDCFGSTATUS4_GPU_MASK                (0x80U)
#define PMC_PDCFGSTATUS4_GPU_SHIFT               (7U)
/*! GPU - VGPU RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_GPU(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_GPU_SHIFT)) & PMC_PDCFGSTATUS4_GPU_MASK)

#define PMC_PDCFGSTATUS4_DMA2_3_MASK             (0x100U)
#define PMC_PDCFGSTATUS4_DMA2_3_SHIFT            (8U)
/*! DMA2_3 - DMA2 and DMA3 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DMA2_3(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DMA2_3_SHIFT)) & PMC_PDCFGSTATUS4_DMA2_3_MASK)

#define PMC_PDCFGSTATUS4_DMA0_1_P_E_MASK         (0x200U)
#define PMC_PDCFGSTATUS4_DMA0_1_P_E_SHIFT        (9U)
/*! DMA0_1_P_E - DMA0-1, PKC, and ETF RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DMA0_1_P_E(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DMA0_1_P_E_SHIFT)) & PMC_PDCFGSTATUS4_DMA0_1_P_E_MASK)

#define PMC_PDCFGSTATUS4_CPU0_CCACHE_MASK        (0x400U)
#define PMC_PDCFGSTATUS4_CPU0_CCACHE_SHIFT       (10U)
/*! CPU0_CCACHE - CPU0 Code Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_CPU0_CCACHE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_CPU0_CCACHE_SHIFT)) & PMC_PDCFGSTATUS4_CPU0_CCACHE_MASK)

#define PMC_PDCFGSTATUS4_CPU0_SCACHE_MASK        (0x800U)
#define PMC_PDCFGSTATUS4_CPU0_SCACHE_SHIFT       (11U)
/*! CPU0_SCACHE - CPU0 System Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_CPU0_SCACHE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_CPU0_SCACHE_SHIFT)) & PMC_PDCFGSTATUS4_CPU0_SCACHE_MASK)

#define PMC_PDCFGSTATUS4_DSP_ICACHE_MASK         (0x1000U)
#define PMC_PDCFGSTATUS4_DSP_ICACHE_SHIFT        (12U)
/*! DSP_ICACHE - HiFi4 Instruction Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DSP_ICACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DSP_ICACHE_SHIFT)) & PMC_PDCFGSTATUS4_DSP_ICACHE_MASK)

#define PMC_PDCFGSTATUS4_DSP_DCACHE_MASK         (0x2000U)
#define PMC_PDCFGSTATUS4_DSP_DCACHE_SHIFT        (13U)
/*! DSP_DCACHE - HiFi4 Data Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DSP_DCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DSP_DCACHE_SHIFT)) & PMC_PDCFGSTATUS4_DSP_DCACHE_MASK)

#define PMC_PDCFGSTATUS4_DSP_ITCM_MASK           (0x4000U)
#define PMC_PDCFGSTATUS4_DSP_ITCM_SHIFT          (14U)
/*! DSP_ITCM - HiFi4 Instruction TCM RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DSP_ITCM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DSP_ITCM_SHIFT)) & PMC_PDCFGSTATUS4_DSP_ITCM_MASK)

#define PMC_PDCFGSTATUS4_DSP_DTCM_MASK           (0x8000U)
#define PMC_PDCFGSTATUS4_DSP_DTCM_SHIFT          (15U)
/*! DSP_DTCM - HiFi4 Data TCM RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_DSP_DTCM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_DSP_DTCM_SHIFT)) & PMC_PDCFGSTATUS4_DSP_DTCM_MASK)

#define PMC_PDCFGSTATUS4_EZH_TCM_MASK            (0x10000U)
#define PMC_PDCFGSTATUS4_EZH_TCM_SHIFT           (16U)
/*! EZH_TCM - EZH-V TCM RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_EZH_TCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_EZH_TCM_SHIFT)) & PMC_PDCFGSTATUS4_EZH_TCM_MASK)

#define PMC_PDCFGSTATUS4_NPU_MASK                (0x20000U)
#define PMC_PDCFGSTATUS4_NPU_SHIFT               (17U)
/*! NPU - NPU RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_NPU(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_NPU_SHIFT)) & PMC_PDCFGSTATUS4_NPU_MASK)

#define PMC_PDCFGSTATUS4_XSPI0_MASK              (0x40000U)
#define PMC_PDCFGSTATUS4_XSPI0_SHIFT             (18U)
/*! XSPI0 - XSPI0, MMU0, and Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_XSPI0(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_XSPI0_SHIFT)) & PMC_PDCFGSTATUS4_XSPI0_MASK)

#define PMC_PDCFGSTATUS4_XSPI1_MASK              (0x80000U)
#define PMC_PDCFGSTATUS4_XSPI1_SHIFT             (19U)
/*! XSPI1 - XSPI1, MMU1, and Cache RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_XSPI1(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_XSPI1_SHIFT)) & PMC_PDCFGSTATUS4_XSPI1_MASK)

#define PMC_PDCFGSTATUS4_XSPI2_MASK              (0x100000U)
#define PMC_PDCFGSTATUS4_XSPI2_SHIFT             (20U)
/*! XSPI2 - XSPI2 and MMU2 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_XSPI2(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_XSPI2_SHIFT)) & PMC_PDCFGSTATUS4_XSPI2_MASK)

#define PMC_PDCFGSTATUS4_LCD_MASK                (0x200000U)
#define PMC_PDCFGSTATUS4_LCD_SHIFT               (21U)
/*! LCD - LCDIF Controller RAMs Array
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS4_LCD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_LCD_SHIFT)) & PMC_PDCFGSTATUS4_LCD_MASK)

#define PMC_PDCFGSTATUS4_OCOTP_MASK              (0x400000U)
#define PMC_PDCFGSTATUS4_OCOTP_SHIFT             (22U)
/*! OCOTP - OCOTP Shadow SRAM
 *  0b1..Array Power Down
 *  0b0..Array Powered
 */
#define PMC_PDCFGSTATUS4_OCOTP(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_OCOTP_SHIFT)) & PMC_PDCFGSTATUS4_OCOTP_MASK)
/*! @} */

