nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name RED_ALERT_CNT - Red Alert Counter */
/*! @{ */

#define PVTS_RED_ALERT_CNT_CNT_MASK              (0xFFFFFU)
#define PVTS_RED_ALERT_CNT_CNT_SHIFT             (0U)
/*! CNT - Counter */
#define PVTS_RED_ALERT_CNT_CNT(x)                (((uint32_t)(((uint32_t)(x)) << PVTS_RED_ALERT_CNT_CNT_SHIFT)) & PVTS_RED_ALERT_CNT_CNT_MASK)
/*! @} */

/* The count of PVTS_RED_ALERT_CNT */
#define PVTS_RED_ALERT_CNT_COUNT                 (2U)

/*! @name RED_ALERT_CNT_CTRL - Red Alert Counter Control */
/*! @{ */

#define PVTS_RED_ALERT_CNT_CTRL_CNTEN_MASK       (0x1U)
#define PVTS_RED_ALERT_CNT_CTRL_CNTEN_SHIFT      (0U)
/*! CNTEN - Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_RED_ALERT_CNT_CTRL_CNTEN(x)         (((uint32_t)(((uint32_t)(x)) << PVTS_RED_ALERT_CNT_CTRL_CNTEN_SHIFT)) & PVTS_RED_ALERT_CNT_CTRL_CNTEN_MASK)
/*! @} */

/* The count of PVTS_RED_ALERT_CNT_CTRL */
#define PVTS_RED_ALERT_CNT_CTRL_COUNT            (2U)

/*! @name AMBER_DEL_CTRL - Amber Delay Control */
/*! @{ */

#define PVTS_AMBER_DEL_CTRL_DELAY0_MASK          (0x1FU)
#define PVTS_AMBER_DEL_CTRL_DELAY0_SHIFT         (0U)
/*! DELAY0 - Amber Delay Section 0 */
#define PVTS_AMBER_DEL_CTRL_DELAY0(x)            (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_DEL_CTRL_DELAY0_SHIFT)) & PVTS_AMBER_DEL_CTRL_DELAY0_MASK)

#define PVTS_AMBER_DEL_CTRL_DELAY1_MASK          (0x3E0U)
#define PVTS_AMBER_DEL_CTRL_DELAY1_SHIFT         (5U)
/*! DELAY1 - Amber Delay Section 1 */
#define PVTS_AMBER_DEL_CTRL_DELAY1(x)            (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_DEL_CTRL_DELAY1_SHIFT)) & PVTS_AMBER_DEL_CTRL_DELAY1_MASK)
/*! @} */

/* The count of PVTS_AMBER_DEL_CTRL */
#define PVTS_AMBER_DEL_CTRL_COUNT                (2U)

/*! @name AMBER_RING_OSC_CTRL - Amber Ring OSC Control */
/*! @{ */

#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_MASK  (0x1U)
#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_SHIFT (0U)
/*! RINGOSCEN - Amber Ring Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN(x)    (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_RINGOSCEN_MASK)

#define PVTS_AMBER_RING_OSC_CTRL_CNTEN_MASK      (0x2U)
#define PVTS_AMBER_RING_OSC_CTRL_CNTEN_SHIFT     (1U)
/*! CNTEN - Amber Ring OSC Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_AMBER_RING_OSC_CTRL_CNTEN(x)        (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_CNTEN_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_CNTEN_MASK)

#define PVTS_AMBER_RING_OSC_CTRL_CNTRST_MASK     (0x4U)
#define PVTS_AMBER_RING_OSC_CTRL_CNTRST_SHIFT    (2U)
/*! CNTRST - Amber Ring OSC Counter Reset
 *  0b0..Not resets
 *  0b1..Resets
 */
#define PVTS_AMBER_RING_OSC_CTRL_CNTRST(x)       (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_OSC_CTRL_CNTRST_SHIFT)) & PVTS_AMBER_RING_OSC_CTRL_CNTRST_MASK)
/*! @} */

/* The count of PVTS_AMBER_RING_OSC_CTRL */
#define PVTS_AMBER_RING_OSC_CTRL_COUNT           (2U)

/*! @name AMBER_RING_CNT - Amber Ring OSC Counter */
/*! @{ */

#define PVTS_AMBER_RING_CNT_CNT_MASK             (0xFFFFFFFFU)
#define PVTS_AMBER_RING_CNT_CNT_SHIFT            (0U)
/*! CNT - Counter */
#define PVTS_AMBER_RING_CNT_CNT(x)               (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_RING_CNT_CNT_SHIFT)) & PVTS_AMBER_RING_CNT_CNT_MASK)
/*! @} */

/* The count of PVTS_AMBER_RING_CNT */
#define PVTS_AMBER_RING_CNT_COUNT                (2U)

/*! @name AMBER_ALERT_CNT - Amber Alert Counter */
/*! @{ */

#define PVTS_AMBER_ALERT_CNT_CNT_MASK            (0xFFFFFU)
#define PVTS_AMBER_ALERT_CNT_CNT_SHIFT           (0U)
/*! CNT - Counter */
#define PVTS_AMBER_ALERT_CNT_CNT(x)              (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_ALERT_CNT_CNT_SHIFT)) & PVTS_AMBER_ALERT_CNT_CNT_MASK)
/*! @} */

/* The count of PVTS_AMBER_ALERT_CNT */
#define PVTS_AMBER_ALERT_CNT_COUNT               (2U)

/*! @name AMBER_ALERT_CNT_CTRL - Amber Alert Counter Control */
/*! @{ */

#define PVTS_AMBER_ALERT_CNT_CTRL_CNTEN_MASK     (0x1U)
#define PVTS_AMBER_ALERT_CNT_CTRL_CNTEN_SHIFT    (0U)
/*! CNTEN - Counter Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PVTS_AMBER_ALERT_CNT_CTRL_CNTEN(x)       (((uint32_t)(((uint32_t)(x)) << PVTS_AMBER_ALERT_CNT_CTRL_CNTEN_SHIFT)) & PVTS_AMBER_ALERT_CNT_CTRL_CNTEN_MASK)
/*! @} */

/* The count of PVTS_AMBER_ALERT_CNT_CTRL */
#define PVTS_AMBER_ALERT_CNT_CTRL_COUNT          (2U)


/*!
 * @}
 */ /* end of group PVTS_Register_Masks */


/* PVTS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PVTS1 base address */
  #define PVTS1_BASE                               (0x50043000u)
  /** Peripheral PVTS1 base address */
  #define PVTS1_BASE_NS                            (0x40043000u)
  /** Peripheral PVTS1 base pointer */
  #define PVTS1                                    ((PVTS_Type *)PVTS1_BASE)
  /** Peripheral PVTS1 base pointer */
  #define PVTS1_NS                                 ((PVTS_Type *)PVTS1_BASE_NS)
  /** Array initializer of PVTS peripheral base addresses */
  #define PVTS_BASE_ADDRS                          { PVTS1_BASE }
  /** Array initializer of PVTS peripheral base pointers */
  #define PVTS_BASE_PTRS                           { PVTS1 }
  /** Array initializer of PVTS peripheral base addresses */
  #define PVTS_BASE_ADDRS_NS                       { PVTS1_BASE_NS }
  /** Array initializer of PVTS peripheral base pointers */
  #define PVTS_BASE_PTRS_NS                        { PVTS1_NS }
#else
  /** Peripheral PVTS1 base address */
  #define PVTS1_BASE                               (0x40043000u)
  /** Peripheral PVTS1 base pointer */
  #define PVTS1                                    ((PVTS_Type *)PVTS1_BASE)
  /** Array initializer of PVTS peripheral base addresses */
  #define PVTS_BASE_ADDRS                          { PVTS1_BASE }
  /** Array initializer of PVTS peripheral base pointers */
  #define PVTS_BASE_PTRS                           { PVTS1 }
#endif

/*!
 * @}
 */ /* end of group PVTS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RSTCTL1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL1_Peripheral_Access_Layer RSTCTL1 Peripheral Access Layer
 * @{
 */

/** RSTCTL1 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PRSTCTL0;                          /**< Sense Domain Private Peripheral Reset Control 0, offset: 0x10 */
       uint8_t RESERVED_1[44];
  __O  uint32_t PRSTCTL0_SET;                      /**< Sense Domain Private Peripheral Reset Control 0 SET, offset: 0x40 */
       uint8_t RESERVED_2[44];
  __O  uint32_t PRSTCTL0_CLR;                      /**< Sense Domain Private Peripheral Reset Control 0 CLR, offset: 0x70 */
} RSTCTL1_Type;

/* ----------------------------------------------------------------------------
   -- RSTCTL1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL1_Register_Masks RSTCTL1 Register Masks
 * @{
 */

/*! @name PRSTCTL0 - Sense Domain Private Peripheral Reset Control 0 */
/*! @{ */

#define RSTCTL1_PRSTCTL0_HIFI1_MASK              (0x2U)
#define RSTCTL1_PRSTCTL0_HIFI1_SHIFT             (1U)
/*! HiFi1 - HiFi1 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_HIFI1(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_HIFI1_SHIFT)) & RSTCTL1_PRSTCTL0_HIFI1_MASK)

#define RSTCTL1_PRSTCTL0_HIFI1_DEBUG_MASK        (0x4U)
#define RSTCTL1_PRSTCTL0_HIFI1_DEBUG_SHIFT       (2U)
/*! HiFi1_DEBUG - HiFi1 Debug Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_HIFI1_DEBUG(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_HIFI1_DEBUG_SHIFT)) & RSTCTL1_PRSTCTL0_HIFI1_DEBUG_MASK)

#define RSTCTL1_PRSTCTL0_EDMA2_MASK              (0x10U)
#define RSTCTL1_PRSTCTL0_EDMA2_SHIFT             (4U)
/*! eDMA2 - eDMA2 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_EDMA2(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_EDMA2_SHIFT)) & RSTCTL1_PRSTCTL0_EDMA2_MASK)

#define RSTCTL1_PRSTCTL0_EDMA3_MASK              (0x20U)
#define RSTCTL1_PRSTCTL0_EDMA3_SHIFT             (5U)
/*! eDMA3 - eDMA3 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL1_PRSTCTL0_EDMA3(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_EDMA3_SHIFT)) & RSTCTL1_PRSTCTL0_EDMA3_MASK)

