nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define RSTCTL4_PRSTCTL0_LCDIF_MASK              (0x8U)
#define RSTCTL4_PRSTCTL0_LCDIF_SHIFT             (3U)
/*! LCDIF - LCDIF Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_LCDIF(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_LCDIF_SHIFT)) & RSTCTL4_PRSTCTL0_LCDIF_MASK)

#define RSTCTL4_PRSTCTL0_MIPI_DSI_HOST_MASK      (0x10U)
#define RSTCTL4_PRSTCTL0_MIPI_DSI_HOST_SHIFT     (4U)
/*! MIPI_DSI_HOST - MIPI_DSI_HOST Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_MIPI_DSI_HOST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_MIPI_DSI_HOST_SHIFT)) & RSTCTL4_PRSTCTL0_MIPI_DSI_HOST_MASK)

#define RSTCTL4_PRSTCTL0_EZHV_MASK               (0x20U)
#define RSTCTL4_PRSTCTL0_EZHV_SHIFT              (5U)
/*! EZHV - EZHV Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_EZHV(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_EZHV_SHIFT)) & RSTCTL4_PRSTCTL0_EZHV_MASK)

#define RSTCTL4_PRSTCTL0_JPEGDEC_MASK            (0x40U)
#define RSTCTL4_PRSTCTL0_JPEGDEC_SHIFT           (6U)
/*! JPEGDEC - JPEGDEC Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_JPEGDEC(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_JPEGDEC_SHIFT)) & RSTCTL4_PRSTCTL0_JPEGDEC_MASK)

#define RSTCTL4_PRSTCTL0_PNGDEC_MASK             (0x80U)
#define RSTCTL4_PRSTCTL0_PNGDEC_SHIFT            (7U)
/*! PNGDEC - PNGDEC Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_PNGDEC(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_PNGDEC_SHIFT)) & RSTCTL4_PRSTCTL0_PNGDEC_MASK)

#define RSTCTL4_PRSTCTL0_XSPI2_MASK              (0x100U)
#define RSTCTL4_PRSTCTL0_XSPI2_SHIFT             (8U)
/*! XSPI2 - XSPI2 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_XSPI2(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_XSPI2_SHIFT)) & RSTCTL4_PRSTCTL0_XSPI2_MASK)

#define RSTCTL4_PRSTCTL0_LPSPI14_MASK            (0x2000U)
#define RSTCTL4_PRSTCTL0_LPSPI14_SHIFT           (13U)
/*! LPSPI14 - LPSPI14 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_LPSPI14(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_LPSPI14_SHIFT)) & RSTCTL4_PRSTCTL0_LPSPI14_MASK)

#define RSTCTL4_PRSTCTL0_LPSPI16_MASK            (0x4000U)
#define RSTCTL4_PRSTCTL0_LPSPI16_SHIFT           (14U)
/*! LPSPI16 - LPSPI16 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_LPSPI16(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_LPSPI16_SHIFT)) & RSTCTL4_PRSTCTL0_LPSPI16_MASK)

#define RSTCTL4_PRSTCTL0_FLEXIO0_MASK            (0x8000U)
#define RSTCTL4_PRSTCTL0_FLEXIO0_SHIFT           (15U)
/*! FLEXIO0 - FLEXIO0 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_FLEXIO0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_FLEXIO0_SHIFT)) & RSTCTL4_PRSTCTL0_FLEXIO0_MASK)
/*! @} */

/*! @name PRSTCTL1 - Media Domain (Interface) Peripheral Reset Control 1 */
/*! @{ */

#define RSTCTL4_PRSTCTL1_USB0_MASK               (0x1U)
#define RSTCTL4_PRSTCTL1_USB0_SHIFT              (0U)
/*! USB0 - USB0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL4_PRSTCTL1_USB0(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL1_USB0_SHIFT)) & RSTCTL4_PRSTCTL1_USB0_MASK)

#define RSTCTL4_PRSTCTL1_USBPHY0_MASK            (0x2U)
#define RSTCTL4_PRSTCTL1_USBPHY0_SHIFT           (1U)
/*! USBPHY0 - USBPHY0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL4_PRSTCTL1_USBPHY0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL1_USBPHY0_SHIFT)) & RSTCTL4_PRSTCTL1_USBPHY0_MASK)

#define RSTCTL4_PRSTCTL1_USB1_MASK               (0x4U)
#define RSTCTL4_PRSTCTL1_USB1_SHIFT              (2U)
/*! USB1 - USB1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL4_PRSTCTL1_USB1(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL1_USB1_SHIFT)) & RSTCTL4_PRSTCTL1_USB1_MASK)

#define RSTCTL4_PRSTCTL1_USDHC0_MASK             (0x10U)
#define RSTCTL4_PRSTCTL1_USDHC0_SHIFT            (4U)
/*! uSDHC0 - uSDHC0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL4_PRSTCTL1_USDHC0(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL1_USDHC0_SHIFT)) & RSTCTL4_PRSTCTL1_USDHC0_MASK)

#define RSTCTL4_PRSTCTL1_USDHC1_MASK             (0x20U)
#define RSTCTL4_PRSTCTL1_USDHC1_SHIFT            (5U)
/*! uSDHC1 - uSDHC1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL4_PRSTCTL1_USDHC1(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL1_USDHC1_SHIFT)) & RSTCTL4_PRSTCTL1_USDHC1_MASK)
/*! @} */

/*! @name PRSTCTL0_SET - Media Domain Peripheral Reset Control 0 SET */
/*! @{ */

#define RSTCTL4_PRSTCTL0_SET_VGPU_MASK           (0x4U)
#define RSTCTL4_PRSTCTL0_SET_VGPU_SHIFT          (2U)
/*! VGPU - VGPU Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_VGPU(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_VGPU_SHIFT)) & RSTCTL4_PRSTCTL0_SET_VGPU_MASK)

#define RSTCTL4_PRSTCTL0_SET_LCDIF_MASK          (0x8U)
#define RSTCTL4_PRSTCTL0_SET_LCDIF_SHIFT         (3U)
/*! LCDIF - LCDIF Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_LCDIF(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_LCDIF_SHIFT)) & RSTCTL4_PRSTCTL0_SET_LCDIF_MASK)

#define RSTCTL4_PRSTCTL0_SET_MIPI_DSI_HOST_MASK  (0x10U)
#define RSTCTL4_PRSTCTL0_SET_MIPI_DSI_HOST_SHIFT (4U)
/*! MIPI_DSI_HOST - MIPI_DSI_HOST Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_MIPI_DSI_HOST(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_MIPI_DSI_HOST_SHIFT)) & RSTCTL4_PRSTCTL0_SET_MIPI_DSI_HOST_MASK)

#define RSTCTL4_PRSTCTL0_SET_EZHV_MASK           (0x20U)
#define RSTCTL4_PRSTCTL0_SET_EZHV_SHIFT          (5U)
/*! EZHV - EZHV Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_EZHV(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_EZHV_SHIFT)) & RSTCTL4_PRSTCTL0_SET_EZHV_MASK)

#define RSTCTL4_PRSTCTL0_SET_JPEGDEC_MASK        (0x40U)
#define RSTCTL4_PRSTCTL0_SET_JPEGDEC_SHIFT       (6U)
/*! JPEGDEC - JPEGDEC Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_JPEGDEC(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_JPEGDEC_SHIFT)) & RSTCTL4_PRSTCTL0_SET_JPEGDEC_MASK)

#define RSTCTL4_PRSTCTL0_SET_PNGDEC_MASK         (0x80U)
#define RSTCTL4_PRSTCTL0_SET_PNGDEC_SHIFT        (7U)
/*! PNGDEC - PNGDEC Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_PNGDEC(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_PNGDEC_SHIFT)) & RSTCTL4_PRSTCTL0_SET_PNGDEC_MASK)

#define RSTCTL4_PRSTCTL0_SET_XSPI2_MASK          (0x100U)
#define RSTCTL4_PRSTCTL0_SET_XSPI2_SHIFT         (8U)
/*! XSPI2 - XSPI2 Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_XSPI2(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_XSPI2_SHIFT)) & RSTCTL4_PRSTCTL0_SET_XSPI2_MASK)

#define RSTCTL4_PRSTCTL0_SET_LPSPI14_MASK        (0x2000U)
#define RSTCTL4_PRSTCTL0_SET_LPSPI14_SHIFT       (13U)
/*! LPSPI14 - LPSPI14 Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_LPSPI14(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_LPSPI14_SHIFT)) & RSTCTL4_PRSTCTL0_SET_LPSPI14_MASK)

#define RSTCTL4_PRSTCTL0_SET_LPSPI16_MASK        (0x4000U)
#define RSTCTL4_PRSTCTL0_SET_LPSPI16_SHIFT       (14U)
/*! LPSPI16 - LPSPI16 Reset
 *  0b1..Sets reset.
 *  0b0..No effect
 */
#define RSTCTL4_PRSTCTL0_SET_LPSPI16(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_SET_LPSPI16_SHIFT)) & RSTCTL4_PRSTCTL0_SET_LPSPI16_MASK)

