nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name WAKEUPEN0_SET - Wakeup Enable 0 Set */
/*! @{ */

#define SLEEPCON1_WAKEUPEN0_SET_FRO0_MASK        (0x2U)
#define SLEEPCON1_WAKEUPEN0_SET_FRO0_SHIFT       (1U)
/*! FRO0 - FRO0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_FRO0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_FRO0_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_FRO0_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_FRO1_MASK        (0x4U)
#define SLEEPCON1_WAKEUPEN0_SET_FRO1_SHIFT       (2U)
/*! FRO1 - FRO1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_FRO1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_FRO1_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_FRO1_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_FRO2_MASK        (0x8U)
#define SLEEPCON1_WAKEUPEN0_SET_FRO2_SHIFT       (3U)
/*! FRO2 - FRO2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_FRO2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_FRO2_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_FRO2_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_UTICK1_MASK      (0x20U)
#define SLEEPCON1_WAKEUPEN0_SET_UTICK1_SHIFT     (5U)
/*! UTICK1 - UTICK1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_UTICK1(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_UTICK1_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_UTICK1_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_CTIMER5_MASK     (0x80U)
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER5_SHIFT    (7U)
/*! CTIMER5 - CTIMER5 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER5(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_CTIMER5_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_CTIMER5_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_CTIMER6_MASK     (0x100U)
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER6_SHIFT    (8U)
/*! CTIMER6 - CTIMER6 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER6(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_CTIMER6_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_CTIMER6_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_CTIMER7_MASK     (0x200U)
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER7_SHIFT    (9U)
/*! CTIMER7 - CTIMER7 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_CTIMER7(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_CTIMER7_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_CTIMER7_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_LPI2C15_MASK     (0x400U)
#define SLEEPCON1_WAKEUPEN0_SET_LPI2C15_SHIFT    (10U)
/*! LPI2C15 - LPI2C15 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_LPI2C15(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_LPI2C15_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_LPI2C15_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM17_MASK (0x800U)
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM17_SHIFT (11U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM17(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM17_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM17_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM18_MASK (0x1000U)
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM18_SHIFT (12U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM18(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM18_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM18_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM19_MASK (0x2000U)
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM19_SHIFT (13U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM19(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM19_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM19_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM20_MASK (0x4000U)
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM20_SHIFT (14U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM20(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM20_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_LP_FLEXCOMM20_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_ADC0_MASK        (0x8000U)
#define SLEEPCON1_WAKEUPEN0_SET_ADC0_SHIFT       (15U)
/*! ADC0 - ADC0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_ADC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_ADC0_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_ADC0_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_ACMP0_MASK       (0x40000U)
#define SLEEPCON1_WAKEUPEN0_SET_ACMP0_SHIFT      (18U)
/*! ACMP0 - ACMP0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_ACMP0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_ACMP0_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_ACMP0_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_RD_ERR_MASK (0x80000U)
#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_RD_ERR_SHIFT (19U)
/*! MICFIL_RD_ERR - MICFIL Read Data Error Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_RD_ERR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_MICFIL_RD_ERR_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_MICFIL_RD_ERR_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_WKUP_MASK (0x400000U)
#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_WKUP_SHIFT (22U)
/*! MICFIL_WKUP - MICFIL Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_MICFIL_WKUP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_MICFIL_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_MICFIL_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_RTC1_ALARM_MASK  (0x800000U)
#define SLEEPCON1_WAKEUPEN0_SET_RTC1_ALARM_SHIFT (23U)
/*! RTC1_ALARM - RTC1_ALARM Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_RTC1_ALARM(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_RTC1_ALARM_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_RTC1_ALARM_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_RTC1_WKUP_MASK   (0x1000000U)
#define SLEEPCON1_WAKEUPEN0_SET_RTC1_WKUP_SHIFT  (24U)
/*! RTC1_WKUP - RTC1_WKUP Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_RTC1_WKUP(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_RTC1_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_RTC1_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_MU1_MUB_MASK     (0x4000000U)
#define SLEEPCON1_WAKEUPEN0_SET_MU1_MUB_SHIFT    (26U)
/*! MU1_MUB - MU1_MUB Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_MU1_MUB(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_MU1_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_MU1_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_MU2_MUB_MASK     (0x8000000U)
#define SLEEPCON1_WAKEUPEN0_SET_MU2_MUB_SHIFT    (27U)
/*! MU2_MUB - MU2_MUB Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_MU2_MUB(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_MU2_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_MU2_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_MU3_MUA_MASK     (0x10000000U)
#define SLEEPCON1_WAKEUPEN0_SET_MU3_MUA_SHIFT    (28U)
/*! MU3_MUA - MU3_MUA Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_MU3_MUA(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_MU3_MUA_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_MU3_MUA_MASK)

