nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
#define SYSCON4_ARM2EZHV_INT_CTRL_SEIP_MASK      (0x2U)
#define SYSCON4_ARM2EZHV_INT_CTRL_SEIP_SHIFT     (1U)
/*! SEIP - Supervisor External Input Interrupt Request
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_ARM2EZHV_INT_CTRL_SEIP(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_ARM2EZHV_INT_CTRL_SEIP_SHIFT)) & SYSCON4_ARM2EZHV_INT_CTRL_SEIP_MASK)

#define SYSCON4_ARM2EZHV_INT_CTRL_MSIP_MASK      (0x4U)
#define SYSCON4_ARM2EZHV_INT_CTRL_MSIP_SHIFT     (2U)
/*! MSIP - Machine Software Input Interrupt Request
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_ARM2EZHV_INT_CTRL_MSIP(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_ARM2EZHV_INT_CTRL_MSIP_SHIFT)) & SYSCON4_ARM2EZHV_INT_CTRL_MSIP_MASK)

#define SYSCON4_ARM2EZHV_INT_CTRL_MTIP_MASK      (0x8U)
#define SYSCON4_ARM2EZHV_INT_CTRL_MTIP_SHIFT     (3U)
/*! MTIP - Machine Timer Input Interrupt Request
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_ARM2EZHV_INT_CTRL_MTIP(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_ARM2EZHV_INT_CTRL_MTIP_SHIFT)) & SYSCON4_ARM2EZHV_INT_CTRL_MTIP_MASK)
/*! @} */

/*! @name MIPI_DSI_CTRL - MIPI_DSI Control */
/*! @{ */

#define SYSCON4_MIPI_DSI_CTRL_DSI_SD_MASK        (0x1U)
#define SYSCON4_MIPI_DSI_CTRL_DSI_SD_SHIFT       (0U)
/*! DSI_SD - DSI Shutdown Control
 *  0b0..Do not send
 *  0b1..Send
 */
#define SYSCON4_MIPI_DSI_CTRL_DSI_SD(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_DSI_CTRL_DSI_SD_SHIFT)) & SYSCON4_MIPI_DSI_CTRL_DSI_SD_MASK)

#define SYSCON4_MIPI_DSI_CTRL_DSI_CM_MASK        (0x2U)
#define SYSCON4_MIPI_DSI_CTRL_DSI_CM_SHIFT       (1U)
/*! DSI_CM - DSI Color Mode Control
 *  0b0..Normal (full color) mode
 *  0b1..Low color mode (8-bit)
 */
#define SYSCON4_MIPI_DSI_CTRL_DSI_CM(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_DSI_CTRL_DSI_CM_SHIFT)) & SYSCON4_MIPI_DSI_CTRL_DSI_CM_MASK)

#define SYSCON4_MIPI_DSI_CTRL_DSI_TX_ACTIVE_MASK (0x4U)
#define SYSCON4_MIPI_DSI_CTRL_DSI_TX_ACTIVE_SHIFT (2U)
/*! DSI_TX_ACTIVE - DSI Transmit Active */
#define SYSCON4_MIPI_DSI_CTRL_DSI_TX_ACTIVE(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_DSI_CTRL_DSI_TX_ACTIVE_SHIFT)) & SYSCON4_MIPI_DSI_CTRL_DSI_TX_ACTIVE_MASK)
/*! @} */

/*! @name MEDIA_AUTOGATE_EN - VDD2_MEDIA Auto Gating Enable */
/*! @{ */

#define SYSCON4_MEDIA_AUTOGATE_EN_MATRIX_EN_MASK (0x1U)
#define SYSCON4_MEDIA_AUTOGATE_EN_MATRIX_EN_SHIFT (0U)
/*! MATRIX_EN - VDD2_MEDIA Automatic Clock Gating Enable
 *  0b1..Enables clock gating
 *  0b0..Disables clock gating (continuous clock)
 */
#define SYSCON4_MEDIA_AUTOGATE_EN_MATRIX_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON4_MEDIA_AUTOGATE_EN_MATRIX_EN_SHIFT)) & SYSCON4_MEDIA_AUTOGATE_EN_MATRIX_EN_MASK)
/*! @} */

/*! @name USB0_MEM_CTRL - USB0 Memory Control */
/*! @{ */

#define SYSCON4_USB0_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON4_USB0_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB0_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB0_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_USB0_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_USB0_MEM_CTRL_MEM_WIG_MASK       (0x100U)
#define SYSCON4_USB0_MEM_CTRL_MEM_WIG_SHIFT      (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB0_MEM_CTRL_MEM_WIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB0_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON4_USB0_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON4_USB0_MEM_CTRL_MEM_RIG_MASK       (0x200U)
#define SYSCON4_USB0_MEM_CTRL_MEM_RIG_SHIFT      (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB0_MEM_CTRL_MEM_RIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB0_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON4_USB0_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

/*! @name USB1_MEM_CTRL - USB1 Memory Control */
/*! @{ */

#define SYSCON4_USB1_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON4_USB1_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB1_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB1_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_USB1_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_USB1_MEM_CTRL_MEM_WIG_MASK       (0x100U)
#define SYSCON4_USB1_MEM_CTRL_MEM_WIG_SHIFT      (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB1_MEM_CTRL_MEM_WIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB1_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON4_USB1_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON4_USB1_MEM_CTRL_MEM_RIG_MASK       (0x200U)
#define SYSCON4_USB1_MEM_CTRL_MEM_RIG_SHIFT      (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USB1_MEM_CTRL_MEM_RIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_USB1_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON4_USB1_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

/*! @name USDHC0_MEM_CTRL - uSDHC0 Memory Control */
/*! @{ */

#define SYSCON4_USDHC0_MEM_CTRL_MEM_STDBY_MASK   (0x80U)
#define SYSCON4_USDHC0_MEM_CTRL_MEM_STDBY_SHIFT  (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USDHC0_MEM_CTRL_MEM_STDBY(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON4_USDHC0_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_USDHC0_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_USDHC0_MEM_CTRL_MEM_WIG_MASK     (0x100U)
#define SYSCON4_USDHC0_MEM_CTRL_MEM_WIG_SHIFT    (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USDHC0_MEM_CTRL_MEM_WIG(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_USDHC0_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON4_USDHC0_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON4_USDHC0_MEM_CTRL_MEM_RIG_MASK     (0x200U)
#define SYSCON4_USDHC0_MEM_CTRL_MEM_RIG_SHIFT    (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_USDHC0_MEM_CTRL_MEM_RIG(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_USDHC0_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON4_USDHC0_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

/*! @name USDHC1_MEM_CTRL - uSDHC1 Memory Control */
/*! @{ */

