nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_cm33_core1.h
/*! @name IPCR - IP Configuration */
/*! @{ */

#define XSPI_IPCR_IDATSZ_MASK                    (0xFFFFU)
#define XSPI_IPCR_IDATSZ_SHIFT                   (0U)
/*! IDATSZ - IP Data Transfer Size */
#define XSPI_IPCR_IDATSZ(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_IPCR_IDATSZ_SHIFT)) & XSPI_IPCR_IDATSZ_MASK)

#define XSPI_IPCR_SEQID_MASK                     (0xF000000U)
#define XSPI_IPCR_SEQID_SHIFT                    (24U)
/*! SEQID - LUT Sequence ID */
#define XSPI_IPCR_SEQID(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_IPCR_SEQID_SHIFT)) & XSPI_IPCR_SEQID_MASK)
/*! @} */

/*! @name FLSHCR - Flash Memory Configuration */
/*! @{ */

#define XSPI_FLSHCR_TCSS_MASK                    (0xFU)
#define XSPI_FLSHCR_TCSS_SHIFT                   (0U)
/*! TCSS - Serial Flash Memory CS Setup Time */
#define XSPI_FLSHCR_TCSS(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TCSS_SHIFT)) & XSPI_FLSHCR_TCSS_MASK)

#define XSPI_FLSHCR_TCSH_MASK                    (0xF00U)
#define XSPI_FLSHCR_TCSH_SHIFT                   (8U)
/*! TCSH - Serial Flash Memory CS Hold Time */
#define XSPI_FLSHCR_TCSH(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TCSH_SHIFT)) & XSPI_FLSHCR_TCSH_MASK)

#define XSPI_FLSHCR_TDH_MASK                     (0x30000U)
#define XSPI_FLSHCR_TDH_SHIFT                    (16U)
/*! TDH - Serial Flash Memory Data in Hold Time
 *  0b00..Posedge of XSPI internal reference clock
 *  0b01..2x serial flash memory half clock
 *  *..
 */
#define XSPI_FLSHCR_TDH(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FLSHCR_TDH_SHIFT)) & XSPI_FLSHCR_TDH_MASK)
/*! @} */

/*! @name BUFCR - Buffer Configuration */
/*! @{ */

#define XSPI_BUFCR_MSTRID_MASK                   (0x1FU)
#define XSPI_BUFCR_MSTRID_SHIFT                  (0U)
/*! MSTRID - Manager ID */
#define XSPI_BUFCR_MSTRID(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_MSTRID_SHIFT)) & XSPI_BUFCR_MSTRID_MASK)

#define XSPI_BUFCR_ADATSZ_MASK                   (0x3FF00U)
#define XSPI_BUFCR_ADATSZ_SHIFT                  (8U)
/*! ADATSZ - AHB Data Transfer Size */
#define XSPI_BUFCR_ADATSZ(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_ADATSZ_SHIFT)) & XSPI_BUFCR_ADATSZ_MASK)

#define XSPI_BUFCR_SUBBUF0_DIV_MASK              (0xE00000U)
#define XSPI_BUFCR_SUBBUF0_DIV_SHIFT             (21U)
/*! SUBBUF0_DIV - Sub-Buffer Division Factor
 *  0b001..2
 *  0b010..4
 *  0b011..8
 *  0b100..16
 *  *..
 */
#define XSPI_BUFCR_SUBBUF0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_SUBBUF0_DIV_SHIFT)) & XSPI_BUFCR_SUBBUF0_DIV_MASK)

#define XSPI_BUFCR_SUBBUF1_DIV_MASK              (0x7000000U)
#define XSPI_BUFCR_SUBBUF1_DIV_SHIFT             (24U)
/*! SUBBUF1_DIV - Sub-Buffer Division Factor
 *  0b001..2
 *  0b010..4
 *  0b011..8
 *  0b100..16
 *  *..
 */
#define XSPI_BUFCR_SUBBUF1_DIV(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_SUBBUF1_DIV_SHIFT)) & XSPI_BUFCR_SUBBUF1_DIV_MASK)

#define XSPI_BUFCR_SUBBUF2_DIV_MASK              (0x38000000U)
#define XSPI_BUFCR_SUBBUF2_DIV_SHIFT             (27U)
/*! SUBBUF2_DIV - Sub-Buffer Division Factor
 *  0b001..2
 *  0b010..4
 *  0b011..8
 *  0b100..16
 *  *..
 */
#define XSPI_BUFCR_SUBBUF2_DIV(x)                (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_SUBBUF2_DIV_SHIFT)) & XSPI_BUFCR_SUBBUF2_DIV_MASK)

#define XSPI_BUFCR_SUB_DIV_EN_MASK               (0x40000000U)
#define XSPI_BUFCR_SUB_DIV_EN_SHIFT              (30U)
/*! SUB_DIV_EN - Buffer Sub-Division Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_BUFCR_SUB_DIV_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_SUB_DIV_EN_SHIFT)) & XSPI_BUFCR_SUB_DIV_EN_MASK)

#define XSPI_BUFCR_ALLMST_MASK                   (0x80000000U)
#define XSPI_BUFCR_ALLMST_SHIFT                  (31U)
/*! ALLMST - All Manager Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_BUFCR_ALLMST(x)                     (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_ALLMST_SHIFT)) & XSPI_BUFCR_ALLMST_MASK)

#define XSPI_BUFCR_HP_EN_MASK                    (0x80000000U)
#define XSPI_BUFCR_HP_EN_SHIFT                   (31U)
/*! HP_EN - High Priority Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_BUFCR_HP_EN(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_BUFCR_HP_EN_SHIFT)) & XSPI_BUFCR_HP_EN_MASK)
/*! @} */

/* The count of XSPI_BUFCR */
#define XSPI_BUFCR_COUNT                         (4U)

/*! @name BFGENCR - Buffer Generic Configuration */
/*! @{ */

#define XSPI_BFGENCR_SEQID_RDSR_MASK             (0xFU)
#define XSPI_BFGENCR_SEQID_RDSR_SHIFT            (0U)
/*! SEQID_RDSR - Read Status Register Sequence ID in LUT */
#define XSPI_BFGENCR_SEQID_RDSR(x)               (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_RDSR_SHIFT)) & XSPI_BFGENCR_SEQID_RDSR_MASK)

#define XSPI_BFGENCR_SPLITEN_MASK                (0x100U)
#define XSPI_BFGENCR_SPLITEN_SHIFT               (8U)
/*! SPLITEN - AHB Transaction Split Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_BFGENCR_SPLITEN(x)                  (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SPLITEN_SHIFT)) & XSPI_BFGENCR_SPLITEN_MASK)

#define XSPI_BFGENCR_AHBSSIZE_MASK               (0x600U)
#define XSPI_BFGENCR_AHBSSIZE_SHIFT              (9U)
/*! AHBSSIZE - AHB Split Size
 *  0b00..8 bytes
 *  0b01..16 bytes
 *  0b10..32 bytes
 *  0b11..64 bytes
 */
#define XSPI_BFGENCR_AHBSSIZE(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_AHBSSIZE_SHIFT)) & XSPI_BFGENCR_AHBSSIZE_MASK)

#define XSPI_BFGENCR_SEQID_MASK                  (0xF000U)
#define XSPI_BFGENCR_SEQID_SHIFT                 (12U)
/*! SEQID - LUT Sequence Pointer */
#define XSPI_BFGENCR_SEQID(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_SHIFT)) & XSPI_BFGENCR_SEQID_MASK)

#define XSPI_BFGENCR_SEQID_WR_EN_MASK            (0x20000U)
#define XSPI_BFGENCR_SEQID_WR_EN_SHIFT           (17U)
/*! SEQID_WR_EN - Enable Write Sequence ID
 *  0b0..Disables (use SEQID)
 *  0b1..Enables
 */
#define XSPI_BFGENCR_SEQID_WR_EN(x)              (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_WR_EN_SHIFT)) & XSPI_BFGENCR_SEQID_WR_EN_MASK)

#define XSPI_BFGENCR_PPWF_CLR_MASK               (0x100000U)
#define XSPI_BFGENCR_PPWF_CLR_SHIFT              (20U)
/*! PPWF_CLR - Page Program Wait Flag Clear
 *  0b0..Cleared by software
 *  0b1..Cleared by XSPI. No software intervention required.
 */
#define XSPI_BFGENCR_PPWF_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_PPWF_CLR_SHIFT)) & XSPI_BFGENCR_PPWF_CLR_MASK)

#define XSPI_BFGENCR_WR_FLUSH_EN_MASK            (0x200000U)
#define XSPI_BFGENCR_WR_FLUSH_EN_SHIFT           (21U)
/*! WR_FLUSH_EN - Write Flush Enable
 *  0b0..Not cleared
 *  0b1..Cleared
 */
#define XSPI_BFGENCR_WR_FLUSH_EN(x)              (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_WR_FLUSH_EN_SHIFT)) & XSPI_BFGENCR_WR_FLUSH_EN_MASK)

#define XSPI_BFGENCR_SEQID_WR_MASK               (0xF0000000U)
#define XSPI_BFGENCR_SEQID_WR_SHIFT              (28U)
/*! SEQID_WR - Write Sequence ID */
#define XSPI_BFGENCR_SEQID_WR(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_BFGENCR_SEQID_WR_SHIFT)) & XSPI_BFGENCR_SEQID_WR_MASK)
/*! @} */

